tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*
 * Copyright 2021-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_NETC_H_
#define FSL_NETC_H_

#include "fsl_common.h"
#if defined(FSL_ETH_ENABLE_CACHE_CONTROL)
#include "fsl_cache.h"
#endif
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
#include "fsl_memory.h"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc
#endif
/*! @addtogroup netc
 * @{
 */

/*!
 * @defgroup netc_abbrev Abbreviation in NETC driver
 * @details Abbreviation list in NETC driver
 *   - UC: unicast
 *   - BC: broadcast
 *   - MC: multicast
 *   - IPF: ingress port filter
 *   - VlanC: Vlan classification
 *   - QosC: Qos Classification
 *   - FRER: Frame Replication and Elimination for Reliability
 *   - PSFP: Per-stream Filtering and Policing
 *   - FM: Frame Modification
 *   - SGI: Stream Gate Instance
 *   - SGC: Stream Gate Control List
 *   - ISI: Ingress Stream Identification
 *   - ISC: Ingress stream count
 *   - IS: Ingress Stream Table
 *   - VF: Vlan Filter
 *   - MF: Mac Filter
 *   - EM: Extract Match
 * @ingroup netc
 */

/*! @brief Driver Version */
#define FSL_NETC_DRIVER_VERSION (MAKE_VERSION(2, 10, 1))

/*! @brief Macro to divides an address into a low 32 bits and a possible high 32 bits */
#define NETC_ADDR_LOW_32BIT(x)  ((uint32_t)(x) & 0xFFFFFFFFU)
#define NETC_ADDR_HIGH_32BIT(x) ((4U != sizeof(uintptr_t)) ? (((uintptr_t)(x) >> 32U) & 0xFFFFFFFFU) : 0U)

/*! @brief Status code for the NETC module */
enum
{
    kStatus_NETC_RxFrameEmpty   = MAKE_STATUS(kStatusGroup_NETC, 0), /*!< Rx BD ring empty. */
    kStatus_NETC_RxTsrResp      = MAKE_STATUS(kStatusGroup_NETC, 1), /*!< Rx timestamp reference response  */
    kStatus_NETC_RxFrameError   = MAKE_STATUS(kStatusGroup_NETC, 2), /*!< Rx frame error.  */
    kStatus_NETC_TxFrameOverLen = MAKE_STATUS(kStatusGroup_NETC, 3), /*!< Tx frame over length. */
    kStatus_NETC_LackOfResource =
        MAKE_STATUS(kStatusGroup_NETC, 4), /*!< Lack of resources to configure certain features. */
    kStatus_NETC_Unsupported      = MAKE_STATUS(kStatusGroup_NETC, 5), /*!< Unsupported operation/feature. */
    kStatus_NETC_RxHRZeroFrame    = MAKE_STATUS(kStatusGroup_NETC, 6), /*!< Rx frame host reason is zero */
    kStatus_NETC_RxHRNotZeroFrame = MAKE_STATUS(kStatusGroup_NETC, 7), /*!< Rx frame host reason is not zero */
    kStatus_NETC_NotFound         = MAKE_STATUS(kStatusGroup_NETC, 8), /*!< No entry found in hardware tables */
    kStatus_NETC_EntryExists      = MAKE_STATUS(kStatusGroup_NETC, 9) /*!< An entry already exists in hardware tables */
};

/*! @brief Defines the common interrupt event for callback use. */
typedef enum _netc_ep_event
{
    kNETC_EPRxEvent, /*!< EP Rx interrupt event. */
    kNETC_EPTxEvent  /*!< EP Tx interrupt event. */
} netc_ep_event_t;

/*! @brief Status for the transmit buffer descriptor. */
typedef enum _netc_ep_tx_status
{
    kNETC_EPTxSuccess       = 0x0, /*!< Success transmission. */
    kNETC_EPTxProgramErr    = 0x1, /*!< Error exists in either the Tx BD, the Tx ring registers, or both. */
    kNETC_EPTxTsdDrop       = 0x2, /*!< The time defined in TX_START expired before frame could be transmitted. */
    kNETC_EPTxFrameSizeErr  = 0x8, /*!< Frame size error. */
    kNETC_EPTxNullAddr      = 0x9, /*!< Null address. */
    kNETC_EPTxInvalidLength = 0xA, /*!< Invalid frame/buffer/chain length. */
    kNETC_EPTxSrcMacSpoofingDetect = 0x10, /*!< Source MAC address spoofing detected. */
    kNETC_EPTxPortRestDrop         = 0x20, /*!< Frame dropped due to port reset. */
    kNETC_EPTxPortDisableDrop      = 0x21, /*!< Frame dropped due to port disable. */
    kNETC_EPTxVlanTpidDrop         = 0x40, /*!< VLAN TPID not allowed. */
    kNETC_EPTxSmsoParamErr   = 0x60,  /*!< Programming error in buffer descriptor used for direct switch enqueue. */
    kNETC_EPTxFrameGateErr   = 0x80,  /*!< Frame too large for time gating window. */
    kNETC_EPTxAxiReadErr     = 0x90,  /*!< AXI read error. */
    kNETC_EPTxAxiWriteErr    = 0x91,  /*!< AXI write error. */
    kNETC_EPTxMultiBitECCErr = 0xA0,  /*!< Frame not transmitted(dropped) due to a multi-bit ECC error detected. */
    kNETC_EPTxParityErr      = 0xF0,  /*!< Parity error. */
    kNETC_EPTxSwCongestion   = 0x100, /*!< Frame dropped due to switch congestion. */
} netc_ep_tx_status_t;

/*! @brief VLAN tag struct */
typedef struct _netc_vlan
{
    uint32_t vid : 12;  /*!< Vlan Identifier. */
    uint32_t dei : 1;   /*!< Drop Eligible indicator. */
    uint32_t pcp : 3;   /*!< Priority. */
    uint32_t tpid : 16; /*!< Tag protocol identifier. */
} netc_vlan_t;

/*! @brief Ethernet VLAN Tag protocol identifier */
typedef enum _netc_vlan_tpid_select
{
    kNETC_StanCvlan = 0x0U, /*!< 0x8100. */
    kNETC_StanSvlan,        /*!< 0x88A8. */
    kNETC_CustomVlan1,      /*!< CVLANR1[ETYPE] */
    kNETC_CustomVlan2       /*!< CVLANR2[ETYPE] */
} netc_vlan_tpid_select_t;

/*! @brief Ethernet packet type enumerator */
typedef enum _netc_packet_type
{
    kNETC_PacketUnicast = 0U,
    kNETC_PacketMulticast,
    kNETC_PacketBroadcast,
} netc_packet_type_t;

/*! @brief Host reason*/
typedef enum _netc_host_reason
{
    kNETC_RegularFrame   = 0x0,
    kNETC_IngressMirror  = 0x1,
    kNETC_MACLearning    = 0x2,
    kNETC_TimestampResp  = 0x3,
    kNETC_SoftwareDefHR0 = 0x8,
    kNETC_SoftwareDefHR1 = 0x9,
    kNETC_SoftwareDefHR2 = 0xa,
    kNETC_SoftwareDefHR3 = 0xb,
    kNETC_SoftwareDefHR4 = 0xc,
    kNETC_SoftwareDefHR5 = 0xd,
    kNETC_SoftwareDefHR6 = 0xe,
    kNETC_SoftwareDefHR7 = 0xf
} netc_host_reason_t;

/*! @brief Buffer structure. Driver can send/receive one frame spread across multiple buffers */
typedef struct _ep_buffer_struct
{
    void *buffer;    /*!< Buffer address. */
    uint16_t length; /*!< Buffer data length. */
} netc_buffer_struct_t;

