tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Enumerator for the ETM congestion group */
typedef enum _netc_hw_congestion_group_idx
{
    kNETC_CongGroup0 = 0,
    kNETC_CongGroup1
} netc_hw_congestion_group_idx_t;

/*! @brief Defines the MII/RGMII mode for data interface between the MAC and the PHY. */
typedef enum _netc_hw_mii_mode
{
    kNETC_XgmiiMode = 0U, /*!< XGMII mode for data interface. */
    kNETC_MiiMode   = 1U, /*!< MII mode for data interface. */
    kNETC_GmiiMode  = 2U, /*!< GMII mode for data interface. */
    kNETC_RmiiMode  = 3U, /*!< RMII mode for data interface. */
    kNETC_RgmiiMode = 4U, /*!< RGMII mode for data interface. */
    kNETC_SgmiiMode = 5U, /*!< SGMII mode for data interface. */
} netc_hw_mii_mode_t;

/*! @brief Defines the speed for the *MII data interface. */
typedef enum _netc_hw_mii_speed
{
    kNETC_MiiSpeed10M   = 0U, /*!< Speed 10 Mbps. */
    kNETC_MiiSpeed100M  = 1U, /*!< Speed 100 Mbps. */
    kNETC_MiiSpeed1000M = 2U, /*!< Speed 1000 Mbps. */
    kNETC_MiiSpeed2500M = 3U, /*!< Speed 2500 Mbps. */
    kNETC_MiiSpeed5G    = 4U, /*!< Speed 5Gbps. */
    kNETC_MiiSpeed10G   = 5U, /*!< Speed 10Gbps Mbps. */
} netc_hw_mii_speed_t;

/*! @brief Defines the half or full duplex for the MII data interface. */
typedef enum _netc_hw_mii_duplex
{
    kNETC_MiiHalfDuplex = 0U, /*!< Half duplex mode. */
    kNETC_MiiFullDuplex       /*!< Full duplex mode. */
} netc_hw_mii_duplex_t;

/*! @brief NETC PSFP kc profile configuration, the key size (not include the spmp and portp) is up to 16 bytes */
typedef struct _netc_psfp_kc_profile
{
    bool etp : 1;   /*!< 2 Byte Ethertype field present in the key */
    bool sqtp : 1;  /*!< 1 Byte Sequence Tag present in the key */
    bool ipcpp : 1; /*!< inner VLAN header's PCP field present in the key */
    bool ividp : 1; /*!< inner VLAN ID present in the key */
    bool opcpp : 1; /*!< outer VLAN header's PCP field present in the key */
    bool ovidp : 1; /*!< outer VLAN ID present in the key */
    bool smacp : 1; /*!< 6 bytes of source MAC address present in the key */
    bool dmacp : 1; /*!<  6 bytes of destination MAC address present in the key */
    bool spmp : 1;  /*!< switch port masquerading flag present in the key */
    bool portp : 1; /*!< source port present in the key */
    bool valid : 1; /*!< Key Construction is valid */
    struct
    {
        uint8_t lbMask : 3;     /*!< Payload Last Byte Mask */
        uint8_t fbMask : 3;     /*!< Payload First Byte Mask */
        uint8_t byteOffset : 7; /*!< Payload Byte Offset where field extraction begins */
        uint8_t numBytes : 4;   /*!< Specify the size (numBytes + 1) of the payload key field */
        uint8_t pfp : 1;        /*!< Payload field Present */
    } payload[4];
} netc_isi_kc_rule_t;

/*! @brief NETC Vlan classification config */
typedef struct _netc_vlan_classify_config
{
    bool enableCustom1;        /*!< Enable/Disable custom0 ether type */
    uint16_t custom1EtherType; /*!< Ethertype */
    bool enableCustom2;        /*!< Enable/Disable custom0 ether type */
    uint16_t custom2EtherType; /*!< Ethertype */
    uint16_t preStandRTAGType; /*!< 802.1CB draft 2.0 R-TAG Ethertype value. PSRTAGETR. Only applicable for switch */
} netc_vlan_classify_config_t;

/*! @brief NETC Qos Classification profile file (vlan PCP/DEI to IPV/DR map) */
typedef struct _netc_qos_classify_profile
{
    uint8_t ipv[16]; /*!< Index is created from PCP (3 bits) + DEI (1 bit) field. Value is the mapped IPV for Qos. */
    uint8_t dr[16];  /*!< Index is created from PCP (3 bits) + DEI (1 bit) field. Value is the mapped DR for QoS. */
} netc_qos_classify_profile_t;

/*! @brief NETC Ingress Filter config */
typedef struct _netc_ipf_config
{
    bool l2DiscardMCSmac;      /*!< DOSL2CR. Discard received frames with Multicast SMAC address */
    bool l2DiscardSmacEquDmac; /*!< DOSL2CR. Discard received frames with SMAC = DMAC */
    bool l3DiscardSipEquDip;   /*!< DOSL3CR. Discard IPV3/IPV6 source address == destination address */
} netc_ipf_config_t;

/*! @} */ // end of netc_hw
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_enetc
#endif
/*! @addtogroup netc_hw_enetc
 * @{
 */
/*! @brief ENETC Port outer/inner VLAN tag */
typedef struct _netc_enetc_vlan_tag_t
{
    uint16_t pcp : 3;                 /*!< Priority code point */
    uint16_t dei : 1;                 /*!< Drop eligible indicator */
    uint16_t vid : 12;                /*!< VLAN identifier */
    netc_vlan_tpid_select_t tpid : 2; /*!< Tag protocol identifier */
} netc_enetc_vlan_tag_t;

/*! @brief PORT discard count statistic */
typedef struct _netc_enetc_discard_statistic
{
    uint32_t ingressDR[4];      /*!< Discard count for port ingress congestion different DR */
    uint32_t broadcastReject;   /*!< Broadcast frame drops count due to all SI enable broadcast reject */
    uint32_t smacPruning;       /*!< Frames discard count due to port MAC source address pruning */
    uint32_t unicastMacFilt;    /*!< Unicast frame discard count due to port MAC filtering */
    uint32_t multicastMacFilt;  /*!< Multicast frame discard count due to MAC filtering */
    uint32_t unicastVlanFilt;   /*!< Unicast frame discard count due to VLAN filtering */
    uint32_t multicastVlanFilt; /*!< Multicast frame discard count due to VLAN filtering */
    uint32_t boradcastVlanFilt; /*!< Broadcast frame discard count due to VLAN filtering */
} netc_enetc_port_discard_statistic_t;

/*! @brief ENETC Port outer/inner native VLAN config */
typedef struct _netc_enetc_native_vlan_config_t
{
    bool enUnderZeroVid; /*!< Enable use the port default VLAN VID when the VID in the packet's is zero */
    bool enUnderNoVlan;  /*!< Enable use the port default VLAN VID when the VLAN tag is not present */
    netc_enetc_vlan_tag_t
        vlanTag;         /*!< Port native outer/inner VLAN tag, valid when enUnderZeroVid or enUnderNoVlan is true */
} netc_enetc_native_vlan_config_t;

/*! @brief ENETC parser configuration */
typedef struct _netc_enetc_parser_config_t
{
    bool disL3Checksum; /*!< Disable Layer 3 IPv4 Header checksum validation. */
    bool disL4Checksum; /*!< Disable Layer 4 TCP and UDP checksum validation. */
    struct
    {
        uint16_t etype; /*!< Custom Ethertype value. Upon detecting this ether type the associated code point will be
                           mapped to the parse summary as a Non IP code point. */
        bool en;        /*!< Enables the detection and mapping. */
        uint8_t cp;     /*!< This value is mapped to the parse summary as a Non IP code point. */
    } custEtype[4];
} netc_enetc_parser_config_t;

/*! @} */ // end of netc_hw_enetc
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_enetc
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_port
#endif
/*! @addtogroup netc_hw_port
 * @{
 */

/*! @brief Port time gate scheduling gate list status */
typedef enum _netc_port_tgsl_status
{
    kNETC_OperListActive = 0x1U, /*!< Port operational gate control list is active. */
    kNETC_AdminListPending =
        0x2U                     /*!< Administrative gate control list is pending (configured but not installed yet). */
} netc_port_tgsl_status_t;

/*! @brief Port Tx/Rx discard counter in the datapath processing pipeline or bridge forwarding processing function*/
typedef enum _netc_port_discard_tpye
{
    kNETC_RxDiscard = 0U, /*!< Discarded frames in the receive port datapath processing pipeline. */
    kNETC_TxDiscard,      /*!< Discarded frames in the egress datapath processing pipeline, only for switch. */
    kNETC_BridgeDiscard   /*!< Discarded frames in the bridge forwarding processing function, only for switch. */
} netc_port_discard_tpye_t;

