tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Defines Port TPID acceptance */
typedef enum _netc_port_tpidlist
{
    kNETC_OuterStanCvlan   = 0x1U, /*!< Accept outer Standard C-VLAN 0x8100. */
    kNETC_OuterStanSvlan   = 0x2U, /*!< Accept outer Standard S-VLAN 0x88A8. */
    kNETC_OuterCustomVlan1 = 0x4U, /*!< Accept outer Custom VLAN as defined by CVLANR1[ETYPE]. */
    kNETC_OuterCustomVlan2 = 0x8U, /*!< Accept outer Custom VLAN as defined by CVLANR2[ETYPE]. */
    kNETC_InnerStanCvlan   = 0x1U, /*!< Accept inner Standard C-VLAN 0x8100. */
    kNETC_InnerStanSvlan   = 0x2U, /*!< Accept inner Standard S-VLAN 0x88A8. */
    kNETC_InnerCustomVlan1 = 0x4U, /*!< Accept inner Custom VLAN as defined by CVLANR1[ETYPE]. */
    kNETC_InnerCustomVlan2 = 0x8U, /*!< Accept inner Custom VLAN as defined by CVLANR2[ETYPE]. */
} netc_port_tpidlist_t;

/*! @brief Defines port timestamp selection. */
typedef enum _netc_port_ts_select
{
    kNETC_SyncTime = 0U,  /*!< Synchronized time. */
    kNETC_FreeRunningTime /*!< Free running time. */
} netc_port_ts_select_t;

/*! @brief Port Qos mode */
typedef struct _netc_port_qos_mode
{
    uint8_t qosVlanMap : 4; /*!< Transmit QoS to VLAN PCP Mapping Profile index, only active on switch port */
    uint8_t vlanQosMap : 4; /*!< Receive VLAN PCP/DE to QoS Mapping Profile index, only active on switch port */
    uint8_t defaultIpv : 3; /*!< Port default IPV */
    uint8_t defaultDr : 2;  /*!< Port default DR */
    bool enVlanInfo : 1;    /*!< Enable use VLAN info to determine IPV and DR (base on VLANIPVMPaR0/1 and VLANDRMPaR) */
    bool vlanTagSelect : 1; /*!< True: Outer VLAN, False: Innner VLAN. Active when enVlanInfo is true */
} netc_port_qos_mode_t;

/*! @brief Port Parser config */
typedef struct _netc_port_parser_config
{
    uint8_t l2PloadCount : 5;   /*!< L2 payload fields size in bytes */
    bool enableL3Parser : 1;    /*!< Enable/Disable parser for L3 */
    uint8_t l3PayloadCount : 5; /*!< L3 payload fields size in bytes */
    bool enableL4Parser : 1;    /*!< Enable/Disable parser for L4 */
    uint8_t l4PayloadCount : 5; /*!< L4 payload fields size in bytes */
} netc_port_parser_config_t;

/*! @brief Port time gate config */
typedef struct _netc_port_tg_config
{
    uint16_t advOffset; /*!< Advance time offset in ns. */
    uint32_t holdSkew;  /*!< Hold-Skew in ns, not effective on ports connected to a pseudo-MAC */
} netc_port_tg_config_t;

/*! @brief Port time gate config when used with Frame Preemption */
typedef struct _netc_port_tg_preemption_config
{
    uint16_t holdAdvance;    /*!< the amount of time in ns prior to the Set-And-Hold-MAC time slot for asserting a Hold
                                request. Used with frame Preemption. */
    uint16_t releaseAdvance; /*!< the amount of time in ns prior to the Set-And-Release-MAC time slot for asserting a
                                Release request. Used with Frame Preemption. */
} netc_port_tg_preemption_config;

/*! @brief Port MAC preemption mode */
typedef enum _netc_hw_preemption_mode
{
    kNETC_PreemptDisable = 0U, /*!< Frame preemption is not enabled */
    kNETC_PreemptOn64B,        /*!< Frame preemption is enabled, but transmit only preempts frames on 64B boundaries */
    kNETC_PreemptOn4B          /*!< Frame preemption is enabled, but transmit only preempts frames on 4B boundaries */
} netc_hw_preemption_mode_t;

/*! @brief Port MAC Remote Additional Fragment Size */
typedef enum _netc_hw_raf_size
{
    kNETC_RafSize64 = 0U, /*!< Additional Fragment Size of 64 octets */
    kNETC_RafSize128,     /*!< Additional Fragment Size of 128 octets */
    kNETC_RafSize256,     /*!< Additional Fragment Size of 256 octets */
    kNETC_RafSize512,     /*!< Additional Fragment Size of 512 octets */
} netc_hw_raf_size_t;

/*! @brief Frame Preemption Portconfig */
typedef struct _netc_port_preemption_config
{
    bool enMergeVerify : 1; /*!< Enable verify the merged preemption frame, need to enable when preemptMode is not zero
                             */
    uint8_t mergeVerifyTime : 7; /*!< The nominal wait time between verification attempts in milliseconds, range in 1 ~
                                    128 */
    netc_hw_preemption_mode_t preemptMode : 2; /*!< When set to not zero, PMAC frames may be preempted by EMAC frames */
    netc_hw_raf_size_t raf_size : 2; /*!< Additional Fragment Size. Indicates the smallest sized fragments that can
                                        be sent on Tx */
    bool PreemptionActive : 1; /*!< Local preemption active. Indicates whether preemption is active for this port. This
                                    bit will be set if preemption is both enabled and has completed the verification
                                  process*/
} netc_port_preemption_config;

/*! @brief Configuration for the Credit Based Shaped for port TC.
 *
 *  @note  The 802.1Qav bandwidth availability parameters is is calculated as follows:
 *          - idleSlope (bits) = portTxRate * bwWeight / 100
 *          - sendSlope (bits) = portTxRate * (100 - bwWeight) / 100
 *          - lowCredit (bits) = tcMaxFrameSize * (100 - bwWeight) / 100
 *          - hiCredit (bits) calculation formula depends on the traffic class, Please refer to the Reference manual.
 *          - hiCredit (credits) = (enetClockFrequency / portTxRate) * 100 * hiCredit (bits)
 */
typedef struct _netc_port_tc_cbs_config
{
    uint8_t bwWeight;  /*!< Percentage units of the port transmit rate and the credit-based shaper (range from 0 ~ 100),
                           the sum of all traffic class credit-based shaper's bandwidth cannot exceed 100 */
    uint32_t hiCredit; /*!< The maximum allowed accumulation of credits when conflicting transfers occur,
                          in credit units ((enetClockFrequency / portTxRate) * 100) */
} netc_port_tc_cbs_config_t;

/*! @brief Type of PDU/SDU (Protocol/Service Data Unit).
 *
 *  @note  Overhead values which adding to the transmitted frame of Length are specified by Port SDU config as follows:
 *          - PPDU = add rxPpduBco/txPpduBco + rxMacsecBco/txMacsecBco bytes
 *          - MPDU = add rxMacsecBco/txMacsecBco bytes
 *          - MSDU = minus 16B (12B MAC Header + 4B FCS)
 */
typedef enum _netc_tc_sdu_type
{
    kNETC_PDU = 0U, /*!< Physical Layer PDU, Preamble, IFG, SFD along with MPDU. Not supported if cut-through frames are
                       expected */
    kNETC_MPDU,     /*!< MAC PDU, MAC Header, MSDU and FCS */
    kNETC_MSDU /*!< MAC SDU, MPDU minus 12B MAC Header and 4B FCS. Not supported if cut-through frames are expected */
} netc_tc_sdu_type_t;

typedef struct _netc_port_tc_sdu_config
{
    bool enTxMaxSduCheck; /*!< Enable Tx Max SDU check for Store and Forward frames, the frame which greater than
                           maxSduSized wiil be discarded, Cut-Through frames will always perform Max SDU check */
    netc_tc_sdu_type_t
        sduType;          /*!< Specifies the type of PDU/SDU whose length is being validated as seen on the link */
    uint16_t maxSduSized; /*!< Transmit Maximum SDU size in bytes, the dequeued frame will be discarded when it SDU size
                             exceeds this value */
} netc_port_tc_sdu_config_t;

