tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Configuration for the port Tx Traffic Class */
typedef struct _netc_port_tx_tc_config
{
    bool enPreemption : 1; /*!< Frames from traffic class are transmitted on the preemptable MAC, not supported on
                          internal port (ENETC 1 port and Switch port 4)*/
    bool enTcGate : 1;  /*!< Enable the traffic class gate when no gate control list is operational, or when time gate
                             scheduling is disabled. */
    bool enableTsd : 1; /*!< Enable Time Specific Departure traffic class, only applicable to ENETC */
    bool enableCbs : 1; /*!< Enable Credit based shaper for traffic class  */
    netc_port_tc_sdu_config_t sduCfg;
    netc_port_tc_cbs_config_t cbsCfg; /*!< Configure transmit traffic class credit based shaper (PTC0CBSR0/PTC0CBSR1) if
                                  enableCbs set to ture */
} netc_port_tx_tc_config_t;

/*! @brief Switch or ENETC port Tx/Rx/Bridge discard statistic / reason */
typedef struct _netc_port_discard_statistic
{
    uint32_t count;   /*!< Count of discarded frames. PRXDCR, PTXDCR or BPDCR. */
    uint32_t reason0; /*!< Discard Reason. Find bit detail from PT/RXDCRR0 or BPDCRR0. */
    uint32_t reason1; /*!< Discard Reason. Find bit detail from PT/RXDCRR1 or BPDCRR1.*/
} netc_port_discard_statistic_t;

/*! @brief Port accepted Vlan classification config */
typedef struct _netc_port_vlan_classify_config
{
    uint8_t innerMask : 4; /*!< Bitmap identifying which TPIDs are acceptable as Inner VLAN tag. See PTAR */
    uint8_t outerMask : 4; /*!< Bitmap identifying which TPIDs are acceptable as Outter VLAN tag. See PTAR */
} netc_port_vlan_classify_config_t;

/*! @brief Port Qos Classification Config */
typedef struct _netc_port_qos_classify_configs
{
    uint8_t vlanQosMap : 4; /*!< Receive VLAN PCP/DE to QoS Mapping Profile index */
    uint8_t defaultIpv : 3; /*!< Port default IPV */
    uint8_t defaultDr : 2;  /*!< Port default DR */
    bool enVlanInfo : 1; /*!< Enable use VLAN info to determine IPV and DR ,base on VLAN to IPV map (VLANIPVMPaR0/1) and
                            VLAN to DR map (VLANDRMPaR) */
    bool vlanTagSelect : 1; /*!< True: Use received Outer VLAN, False: Use received Innner VLAN. Active when enVlanInfo
                               is true */
} netc_port_qos_classify_config_t;

/*! @brief Port Ingress Filter Config */
typedef struct _netc_port_ipf_config_t
{
    bool enL2Dos : 1;    /*!< Enable port L2 Ethernet DoS Protection */
    bool enL3Dos : 1;    /*!< Enable port L3 IP DoS Protection */
    bool enIPFTable : 1; /*!< Enable port IPF lookup */
} netc_port_ipf_config_t;

/*! @brief PSFP port config */
/*!
 * @brief Port ingress stream identification config
 *
 * @note The first stream identification find IS_EID has higher precedence value than the second, and the priority of
 *       the IS_EID found by the IPF is specified by the IPF entry RRR bit. The possible orderings are as follows
 *          - RRR = 00b : IPF > enKC0 > enKC1 > defaultISEID
 *          - RRR = 01b : enKC0 > IPF > enKC1 > defaultISEID
 *          - RRR = 10b : enKC0 > enKC1 > IPF > defaultISEID
 */
typedef struct _netc_port_psfp_isi_config
{
    uint16_t defaultISEID; /*!< Default Ingress Stream Entry ID, has lower precedence value than ISI entry and IPF entry
                              defined IS_EID. 0xFFFF means NULL */
    bool enKC1 : 1;        /*!< Enable do the second stream identification with key construction rule 1 or rule 3 */
    bool enKC0 : 1;        /*!< Enable do the first stream identification with key construction rule 0 or rule 2 */
    bool kcPair : 1; /*!< Indicates which Key Construction pair to use for this port, false - user pair0. true - use
                        pair1 only applicable for Switch */
} netc_port_psfp_isi_config;

typedef struct _netc_port_ethmac
{
    bool enableRevMii : 1;                /*!< Enable RevMII mode. */
    netc_port_ts_select_t txTsSelect : 1; /*!< Tx timestamp clock source. */
    bool isTsPointPhy : 1; /*!< True: Timestamp is captured based on PHY SFD detect pulse on Rx and Tx for 2-step
                              timestamping. False: Based on SFD detect at boundary of MAC merge layer and pins/protocol
                              gaskets. */
    netc_hw_mii_mode_t miiMode : 3;     /*!< MII mode. */
    netc_hw_mii_speed_t miiSpeed : 3;   /*!< MII Speed. */
    netc_hw_mii_duplex_t miiDuplex : 1; /*!< MII duplex. */
    bool enTxPad : 1; /*!< Enable ETH MAC Tx Padding, which will pad the frame to a minimum of 60 bytes and append 4
                         octets of FCS. */
    uint8_t rxMinFrameSize : 7; /*!< Receive Minimum Frame Length size in bytes, range in 18 ~ 64, received frames
                                   shorter than 18B are discarded silently. Both for express MAC and preemptable MAC. */
    uint16_t rxMaxFrameSize;    /*!< Receive Maximum Frame Length size in bytes, up to 2000, received frames that exceed
                                   this stated maximum are truncated. Both for express MAC and preemptable MAC. */
    netc_port_preemption_config PreemptionConfig; /*!< Frame Preemption configuration */
    bool rgmiiClkStop : 1;       /*!< True: RGMII transmit clock is stoppable during low power idle. False: It's not
                                    stoppable. */
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
    bool enOneStepTS : 1;        /*!< Enable IEEE-1588 Single-Step timestamp */
    bool enChUpdate : 1;         /*!< Enable correction UDP checksum when enable Single-Step timestamp */
    uint16_t oneStepOffset : 10; /*!< Start offset from the beginning of a frame where the field to update is found
                                    (index to MS byte) */
#endif
    bool enableHalfDuplexFlowCtrl : 1; /*!< Enable/Disable half-duplex flow control. */
    uint16_t maxBackPressOn;  /*!< Maximum amount of time backpressure can stay asserted before stopping to prevent
                                 excess  defer on link partner, in byte times. */
    uint16_t minBackPressOff; /*!< Minimum amount of time backpressure will stay off after reaching the ON max, before
                                      backpressure can reassert after checking if icm_pause_notification is still or
                                 again asserted, in byte times. */
    uint32_t txWakeupTimeCycleEEE; /*!< Energy Efficient Ethernet feature. Defines the number of NETC cycles (which
                                  represents time) required by the PHY to wait before transmitting a new frame after the
                                  application has indicated it wants to end the low power state. */
    uint32_t txSleepTimeCycleEEE;  /*!< Energy Efficient Ethernet feature. Defines the number of NETC cycles (which
                                   represents time) where Tx is idle before mac transmits  low power EEE. A value of 0
                                   does not activate low power EEE transmission. */
} netc_port_ethmac_t;

/*! @brief Defines the Port's Stream Gate Open Gate Check mode. */
typedef enum _netc_port_sg_ogc_mode
{
    kNETC_SGCheckSFD = 0U, /*!< Check whether frame SFD is within the open gate interval. */
    kNETC_SGCheckEntire    /*!< Check whether the entire frame is within the open gate interval. */
} netc_port_sg_ogc_mode_t;

/*! @brief Port common configuration */
typedef struct _netc_port_common
{
    netc_port_vlan_classify_config_t acceptTpid; /*!< Port acceptable VLAN tpid configure. */
    netc_port_ts_select_t rxTsSelect;            /*!< Eth MAC Rx or pseudo MAC Tx timestamp clock source */
    uint16_t pSpeed; /*!< Transmit Port Speed = 10Mbps * (pSpeed+1), Used by ETS, Qbu and to determine if cut-through is
                        permissable  */
    uint8_t rxMacsecBco; /*!< Port receive MACSec byte count overhead which due to MACSec encapsulation */
    uint8_t rxPpduBco;   /*!< Port receive PPDU Byte count overhead which includes IPG, SFD and Preamble */
    uint8_t txMacsecBco; /*!< Port transmit MACSec byte count overhead which due to MACSec encapsulation */
    uint8_t txPpduBco;   /*!< Port transmit PPDU Byte count overhead which includes IPG, SFD and Preamble */
#if (defined(FSL_FEATURE_NETC_HAS_PORT_FCSEA) && FSL_FEATURE_NETC_HAS_PORT_FCSEA)
    bool stompFcs : 1;   /*!< Enable stomp the FCS error frame, not effective on ports connected to a pseudo-MAC, only
                            applies to device with ASIL-B safety requirements */
#endif
    netc_port_sg_ogc_mode_t ogcMode : 1; /*!< Stream Gate Open Gate Check mode, 0b is check whether SFD is within the
                         open gate interval, 1b is check whether the entire frame is within the open gate interval */
    uint32_t pDelay : 24;                /*!< Link propagation delay in ns */
    uint8_t macAddr[6]; /*!< Port MAC address, used for Switch egress frame modification action or ENETC SI0 primary MAC
                           address  */
    netc_port_qos_classify_config_t qosMode; /*!< Port Rx Qos Classification config */
    netc_port_ipf_config_t ipfCfg;           /*!< Port ingress port filter configuration */
    netc_port_tg_config_t timeGate;          /*!< Port Tx time gate config */
    netc_port_parser_config_t parser;        /*!< Port Rx Parser config */
} netc_port_common_t;

/*! @} */ // end of netc_hw_port
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_port
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_port_mac
#endif
/*! @addtogroup netc_hw_port_mac
 * @{
 */

/*! @brief Defines the Ethernet MAC physical port type. */
typedef enum _netc_port_phy_mac_type
{
    kNETC_ExpressMAC = 0U, /*!< The MAC which handles express traffic when frame preemption is enabled or handles all
                                traffic when frame preemption is disabled. */
    kNETC_PreemptableMAC   /*!< The MAC which handles preemptive traffic when frame preemption is enabled. */
} netc_port_phy_mac_type_t;

/*! @brief Definesthe state of the mac merge sublayer with respect to verification as defined in IEEE Std 802.3br-2016.
 */
typedef enum _netc_port_preemption_verify_status
{
    kNETC_VerifyDisable    = 0U, /*!< Verification is disabled */
    kNETC_VerifyInProgress = 2U, /*!< Verification is in progress */
    kNETC_VerifySuccess,         /*!<  Verification was successful */
    kNETC_VerifyFaile,           /*!<  Verification failed */
    kNETC_VerifyUndefined        /*!< Verification is in an undefined state */
} netc_port_preemption_verify_status_t;

