tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Port MAC preemption Status */
typedef struct _netc_port_phy_mac_preemption_status
{
    bool mergeActive;                                  /*!< Transmit preemption is active or not */
    netc_port_preemption_verify_status_t verifyStatus; /*!< Transmit preemption is active or not */
} netc_port_phy_mac_preemption_status_t;

/*! @brief Ethernet MAC physical port traffic (Tx/Rx) statistics counters, when enable frame preemption, one physical
 *         MAC will be divided into a pMAC and a eMAC and statistics counters will also have two groups */
typedef struct _netc_port_phy_mac_traffic_statistic
{
    uint64_t totalOctet;             /*!< Count of MAC received/transmitted good/error Ethernet octets. */
    uint64_t validOctet;             /*!< Count of MAC received/transmitted good Ethernet octets. */
    uint64_t pauseFrame;             /*!< Count of MAC received/transmitted valid PAUSE frames. */
    uint64_t validFrame;             /*!< Count of MAC received/transmitted valid frames. */
    uint64_t vlanFrame;              /*!< Count of MAC received/transmitted valid VLAN tagged frames. */
    uint64_t unicastFrame;           /*!< Count of MAC received/transmitted valid unicast frames. */
    uint64_t multicastFrame;         /*!< Count of MAC received/transmitted valid multicast frames. */
    uint64_t boradcastFrame;         /*!< Count of MAC received/transmitted valid broadcast frames. */
    uint64_t totalPacket;            /*!< Count of MAC received/transmitted good/error packets. */
    uint64_t rxMinPacket;            /*!< Count of MAC received min to 63-octet packets. */
    uint64_t total64BPacket;         /*!< Count of MAC received/transmitted 64 octet packets. */
    uint64_t total65To127BPacket;    /*!< Count of MAC received/transmitted 65 to 127 octet packets. */
    uint64_t total128To255BPacket;   /*!< Count of MAC received/transmitted 128 to 255 octet packets. */
    uint64_t total256To511BPacket;   /*!< Count of MAC received/transmitted 256 to 511 octet packets. */
    uint64_t total511To1023BPacket;  /*!< Count of MAC received/transmitted 512 to 1023 octet packets. */
    uint64_t total1024To1522BPacket; /*!< Count of MAC received/transmitted 1024 to 1522 octet packets. */
    uint64_t total1523ToMaxBPacket;  /*!< Count of MAC received/transmitted 1523 to Max octet packets. */
    uint64_t controlPacket;          /*!< Count of MAC received/transmitted control packets. */
} netc_port_phy_mac_traffic_statistic_t;

/*! @brief Ethernet MAC physical port frame discard/errors status statistics counters, when enable frame preemption, one
 * physical MAC will be divided into a pMAC and a eMAC and statistics counters will also have two groups */
typedef struct _netc_port_phy_mac_discard_statistic
{
    uint64_t rxError;              /*!< Count of MAC received error frames. */
    uint64_t rxUndersized;         /*!< Count of MAC received undersized frames. */
    uint64_t rxOversized;          /*!< Count of MAC received oversized frames. */
    uint64_t rxErrorFCS;           /*!< Count of MAC received check sequence (FCS) error frames. */
    uint64_t rxFragment;           /*!< Count of MAC frames which is shorter than the MIN length and received with a
                                        wrong FCS/CRC. */
    uint64_t rxJabber;             /*!< Count of MAC frames which is larger than the MAX length and received with a
                                        wrong FCS/CRC. */
    uint64_t rxDiscard;            /*!< Count of MAC drops frame. */
    uint64_t rxDiscardNoTruncated; /*!< Count of MAC non-truncated drops frame. */
    uint64_t txErrorFCS;           /*!< Count of MAC transmitted bad FCS frames. */
    uint64_t txUndersized;         /*!< Count of MAC transmitted less than 64B with good FCS frames. */
} netc_port_phy_mac_discard_statistic_t;

/*! @brief Ethernet physical MAC port preemption (Tx/Rx) related statistics counters */
typedef struct _netc_port_phy_mac_preemption_statistic
{
    uint32_t rxReassembledFrame; /*!< Count of MAC frames that were successfully reassembled and delivered to
                                      the MAC. */
    uint32_t rxReassembledError; /*!< Count of MAC frames with reassembly errors. */
    uint32_t rxMPacket;          /*!< Count of the number of additional mPackets received due to preemption. */
    uint32_t rxSMDError;         /*!< Count of received MAC frames / MAC frame fragments rejected due to unknown SMD. */
    uint32_t txPreemptionReq;    /*!< Count of the number of tx preemption HOLD requests. */
    uint32_t txMPacket;          /*!< Count of the number of additional mPackets transmitted due to preemption. */
} netc_port_phy_mac_preemption_statistic_t;

/*! @brief Ethernet pseudo MAC port traffic (Tx/Rx) statistics counters */
typedef struct _netc_port_pseudo_mac_traffic_statistic
{
    uint64_t totalOctet;     /*!< Count of MAC received/transmitted octets. */
    uint64_t unicastFrame;   /*!< Count of MAC received/transmitted unicast frames. */
    uint64_t multicastFrame; /*!< Count of MAC received/transmitted multicast frames. */
    uint64_t boradcastFrame; /*!< Count of MAC received/transmitted broadcast frames . */
} netc_port_pseudo_mac_traffic_statistic_t;

/*! @} */ // end of netc_hw_port_mac
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_port_mac
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_table
#endif
/*! @addtogroup netc_hw_table
 * @{
 */

/*! @brief Table index */
typedef enum _netc_tb_index
{
    kNETC_TGSTable   = 5U,  /*!< Time Gate Scheduling table index */
    kNETC_RPTable    = 10U, /*!< Rate Policer table index */
    kNETC_IPFTable   = 13U, /*!< Ingress Port filter table index */
    kNETC_FDBTable   = 15U, /*!< FDB table index */
    kNETC_L2MCFTable = 16U, /*!< L2 IPV4 Multicast Filter table index */
    kNETC_VFTable    = 18U, /*!< VLAN Filter table index */
    kNETC_ECQTable   = 22U, /*!< ETM Class Queue table index */
    kNETC_ECSTable   = 23U, /*!< ETM Class Scheduler table index */
    kNETC_ISITable   = 30U, /*!< Ingress Stream Identification table index */
    kNETC_ISTable    = 31U, /*!< Ingress Stream table index */
    kNETC_ISFTable   = 32U, /*!< Ingress Stream Filter table index */
    kNETC_ETTable    = 33U, /*!< Egress Treatment table index */
    kNETC_ISGTable   = 34U, /*!< Ingress Sequence Generation table index */
    kNETC_ESRTable   = 35U, /*!< Egress Sequence Recovery table index */
    kNETC_SGITable   = 36U, /*!< Stream Gate Instance table index */
    kNETC_SGCLTable  = 37U, /*!< Stream Gate Control List table index */
    kNETC_ISCTable   = 38U, /*!< Ingress Stream Count table index */
    kNETC_ECTable    = 39U, /*!< Egress Count table index */
    kNETC_FMTable    = 40U, /*!< Frame Modification table index */
    kNETC_BPTable    = 41U, /*!< Buffer Pool table index */
    kNETC_SBPTable   = 42U, /*!< Shared Buffer Pool table index */
    kNETC_ECGTable   = 43U, /*!< ETM Class Group table index */
    kNETC_FMDTable   = 44U  /*!< Frame Modification Data table index */
} netc_tb_index_t;

/*! @brief Table management command operations */
typedef enum _netc_tb_cmd
{
    kNETC_DeleteEntry         = 0x1U, /*!< Delete operation */
    kNETC_UpdateEntry         = 0x2U, /*!< Update operation */
    kNETC_QueryEntry          = 0x4U, /*!< Query operation */
    kNETC_QueryAndDeleteEntry = 0x5U, /*!< Query operation followed by a delete operation */
    kNETC_QueryAndUpdateEntry = 0x6U, /*!< Query operation followed by a update operation */
    kNETC_AddEntry            = 0x8U, /*!< Add operation */
    kNETC_AddOrUpdateEntry = 0xAU, /*!< If the entry exists, is update operation, if not exist, is the Add operation*/
    kNETC_AddAndQueryEntry = 0xCU, /*!< Add operation followed by a query operation */
    kNETC_AddQueryAndUpdateEntry =
        0xEU                       /*!< Add operation followed by a query operation, Then, if the entry existed
                                        prior to the Add operation of this command, the Update operation will be performed. */
} netc_tb_cmd_t;

/*! @brief Table Access Method */
typedef enum _netc_tb_access_mode
{
    kNETC_EntryIDMatch = 0U, /*!< Entry ID Match */
    kNETC_ExactKeyMatch,     /*!< Exact Match Key Element Match */
    kNETC_Search,            /*!< Search with search criteria*/
    kNETC_TernaryKeyMatch    /*!< Ternary Match Key Element Match */
} netc_tb_access_mode_t;

