tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief NTMP version */
typedef enum _netc_cbd_version
{
    kNETC_NtmpV1_0 = 0U, /*!< NTMP Version 1.0 */
    kNETC_NtmpV2_0       /*!< NTMP Version 2.0 */
} netc_cbd_version_t;

/*! @brief Table command response error status */
typedef enum _netc_cmd_error
{
    /* Version 1.0 NTMP Table error status */
    kNETC_FormatError = 0x1U, /*!< Format error : 1. Illegal class or command. 2. Invalid SF bit setting. 3. LENGTH is
                                 zero for long format. 4. LENGTH is too small for buffer size. */
    kNETC_SizeError = 0x2U,   /*!< Size error : 1. Invalid table index, out of range. 2. Table overflow, no additional
                                 entries available. */
    kNETC_AccessError    = 0x4U, /*!< Access violation error, the entity is not allowed to perform the task requested */
    kNETC_ClassError     = 0x8U, /*!< Class specific error */
    kNETC_IntegrityError = 0x10U, /*!< Integrity error, the command did not execute due to a data integrity error (ECC
                                     on internal memory or AXI read/write error) */
    /* Version 2.0 NTMP Table Generic error status */
    kNETC_InvTableID         = 0x80U, /*!< Invalid table ID */
    kNETC_InvAccMethod       = 0x81U, /*!< Invalid Access method */
    kNETC_TableIdxOutRange   = 0x82U, /*!< Table index out of range */
    kNETC_DBNotEnough        = 0x83U, /*!< Request data buffer size or response data buffer size is not sufficient */
    kNETC_InvCmd             = 0x84U, /*!< Invalid command */
    kNETC_ReqDBError         = 0x85U, /*!< Request Data buffer error */
    kNETC_MultiBitError      = 0x86U, /*!< Multi-bit ECC or parity error observed during command processing */
    kNETC_HashEntryLimit     = 0x87U, /*!< Exceeded hash entry limit */
    kNETC_HashChainLimit     = 0x88U, /*!< Exceeded maximum hash collision chain limit and the CAM if present is full */
    kNETC_InvHWGenEntryID    = 0x89U, /*!< Invalid ENTRY_ID for ENTRY_ID generated by hardware */
    kNETC_SrchResDBNotEnough = 0x8AU, /*!< Search command filled the response data buffer before completing the
                                           command */
    kNETC_CmdIdxTableWithITM   = 0x8BU, /*!< Command for index table before OSR[ITM_STATE]=0 */
    kNETC_InvQueryAction       = 0x8CU, /*!< Invalid Query action */
    kNETC_InvTableAccPrivilege = 0x8DU, /*!< Invalid table access privilege */
    kNETC_ReadSysBusErr        = 0x8EU, /*!< System Bus Read Error */
    kNETC_WriteSysBusErr       = 0x8FU, /*!< System Bus Write Error */
    kNETC_ClientErr            = 0x90U, /*!< Client encountered a fault */
    /* Time Gate Scheduling Table error status */
    kNETC_TGSCmdIssue        = 0xD0U,  /*!< Command issued when time gating function is disabled for the port. */
    kNETC_TGSUpdateExistList = 0xD1U,  /*!< Update action attempted on an existing admin gate control list. (should
                                      delete   admin gate control list first before creating a new admin list) */
    kNETC_TGSUpdateOverLength = 0xD2U, /*!< Update action attempted exceeds TGSTCAPR[MAX_GCL_LEN] */
    kNETC_TGSUpdateOverSize   = 0xD3U, /*!< Update action attempted exceeds TGSTCAPR[NUM_WORDS]. */
    kNETC_TGSEntryNotEnough   = 0xD4U, /*!< Insufficient resources to perform the requested operation (not enough free
                                          time gate list entries) */
    kNETC_TGSUpdateNSList = 0xD5U,     /*!< Update action attempted with ADMIN_CYCLE_TIME, ADMIN_TIME_INTERVAL_GE_i or
                        truncated ADMIN_TIME_INTERVAL_GE_n due ADMIN_CYCLE_TIME specified is not sufficient to transmit 64
                        byte of frame data + header overhead. */
    kNETC_TGSUpdateEarlierStartTime = 0xD6U, /*!< Update action attempted with ADMIN_BASE_TIME specified s more than one
                                                second in the past from tcs advance time. */
    kNETC_TGSUpdateOverflowCycle = 0xD7U,   /*!< Update action attempted with ADMIN_CYCLE_TIME + ADMIN_CYCLE_TIME_EXT is
                                           greater than 2^32-1. */
    kNETC_TGSQueryBeforeListActive = 0xD8U, /*!< Query action issued when config change occurred. Retry query.*/
    kNETC_TGSUpdateInvGateValue = 0xD9U, /*!< Update action attempted with ADMIN_HR_CB_GE_i set to an invalid value */
    /* Rate Policer Table error status */
    kNETC_RPSDUTypeOutRange = 0x120U, /*!< SDU_TYPE specified in entry CFGE_DATA is out of range */
    /* Ingress Port Filter Table error status */
    kNETC_IPFInvHR = 0x150U,           /*!< HR value not valid. Only checked if command issued from the Switch
                                          and FLTFA=0x2 or FLTFA=0x3 */
    kNETC_IPFEntryNotFit     = 0x151U, /*!< Entry being added does not fit in table */
    kNETC_IPFWithoutSTSE     = 0x152U, /*!< CFGE_DATA update without STSE_DATA update */
    kNETC_IPFInvRPP          = 0x154U, /*!< RPR set to a reserved value. Only checked if FLTA=0x2. */
    kNETC_IPFFLTATGTOutRange = 0x155U, /*!< FLTA_TGT is outside valid range and not NULL. Only checked if FLTA>0x0 */
    kNETC_IPFInvSwtFLTA      = 0x156U, /*!< FLTA=0x3 when command issued from the Switch. */
    kNETC_IPFInvEnetcFLTA    = 0x157U, /*!< FLTFA>0x1 when command issued from an ENETC PF. */
    /* FDB Table error status */
    kNETC_FDBReachPortLimit = 0x171U, /*!< Failed to add or update and entry because the Port BPCR[DYN_LIMIT] has
                                           been reached */
    kNETC_FDBReachSwtLimit = 0x172U,  /*!< Failed to add entry because the Switch FDBHTMCR[DYN_LIMIT] has been
                                           reached. */
    kNETC_FDBInvEPORT      = 0x173U,  /*!< EPORT value not valid. Only checked if (OETEID=0x1 OR CTD=0x1) */
    kNETC_FDBETEIDOutRange = 0x174U,  /*!< ET_EID is out of range and not NULL. Only checked if OETEID>0x0 */
    kNETC_FDBParityErr     = 0x175U,  /*!< Parity error encountered when adding guaranteed entry */
    /* L2 IPv4 Multicast Filter Table error status */
    kNETC_L2MCFInvEPORT      = 0x181U, /*!< EPORT value not valid. Only checked if (OETEID=0x1 OR CTD=0x1) */
    kNETC_L2MCFETEIDOutRange = 0x182U, /*!< ET_EID is not NULL or within the valid range. Only checked if OETEID>0x0. */
    kNETC_L2MCFInvKEYTYPE    = 0x183U, /*!< KEY_TYPE value not valid */
    /* VLAN Filter Table error status */
    kNETC_VFBASEETEIDOutRange = 0x1A0U, /*!< BASE_ET_EID is out of range or MLO is not valid. */
    /* ETM Class Queue Table error status */
    kNETC_ECQCQ2CGMAPOutRange = 0x1E0U, /*!< CQ2CG_MAP value out-of-range in update command. */
    /* Ingress Stream Identification Table error status */
    kNETC_ISIPortIDOutRange = 0x260U, /*!< Port ID specified in KEYE_DATA is out of range. */
    kNETC_ISIInvISEID       = 0x261U, /*!< IS_EID in invalid. */
    /* Ingress Stream Table error status */
    kNETC_ISInvOpt = 0x270U,   /*!< Option specified in one or more of the following fields is not valid – FA, CTD or
                                       ISQA, SDU_TYPE. */
    kNETC_ISInvID = 0x271U,    /*!< One or more of following : 1. Entry IDs are not in valid range or Entry ID is not
                                  Null. 2. Check valid ranges specified for these Entry IDs in Ingress Stream table entry –
                                  RP_EID, SGI_EID, ISQ_EID, ET_EID or EPORT. 3. ET_EID is checked if (FA =010b .. 101b) &
                                  (OETEID!=0). 4. EPORT is checked if (FA = 010b .. 101b) & (OETEID= 0x1 OR CTD= 0x1). 5.
                                  HR is chked if FA = 001b, 100b, or 101b. HR specified cannot be 0x0*/
    kNETC_ISInvFMEID = 0x272U, /*!< FM_EID format or index is out of range : 1. FM_EID format option type is invalid. 2.
                                  FM_EID format is option 1 and the Index is out of range and not Null, or FM_EID format
                                  is option 2 and VUDA or SQTA is out of range.*/
    /* Ingress Stream Filter Table error status */
    kNETC_ISFInvISEID = 0x280U, /*!< IS_EID in KEYE_DATA is invalid. */
    kNETC_ISFInvCFGE = 0x281U, /*!< Any of the following in CFGE_DATA is invalid : 1. One or more of following Entry IDs
                                are not in valid range or Entry ID specified is not Null. Checks are performed for
                                following Entry IDs CFGE DATA – RP_EID, SGI_EID, ISC_EID. 2. SDU_TYPE is invalid */
    /* Egress Treatment Table error status */
    kNETC_ETInvOpt = 0x290U, /*!< Command option specified is invalid or not supported. ESQA is not 00 or 10 (others are
                                reserved), or ECA > 1 (reserved). */
    kNETC_ETInvFMEID = 0x291U, /*!< FM_EID format or index is out of range. Check performed is as follows : 1. EFM_EID
                                  format option type is invalid, or EFM_EID format is option 1 and the Index is out of
                                  range and not Null, or EFM_EID format is option 2 and VUDA or SQTA is out of range
                                  . 2. the Egress Counter Table index EC_EID is out of range. 3. The Egress Sequence
                                  Actions Target Entry ID ESQA_TGT_EID is out of range*/
    /* Ingress Sequence Generation Table error status */
    kNETC_ISGInvQSTAG = 0x2A0U, /*!< SQ_TAG specified is not valid */
    /* Stream Gate Instance Table error status */
    kNETC_SGISGCLEIDOutRange = 0x2C0U,  /*!< SGCL_EID specified in out of range for Add or Update operation. */
    kNETC_SGIInvSDUTYPE      = 0x2C1U,  /*!< SDU_TYPE is specified is invalid for Add or Update operation. */
    kNETC_SGISGCLEIDNotAlloc = 0x2C2U,  /*!< Either the SGCL_EID specified as admin gate control list in Add or Update
                                      operation has not been allocated or SGCL_EID is not the first entry in gate control
                                      list or the reference count in SGCL entry is not 0. */
    kNETC_SGIInvSGCLEID       = 0x2C3U, /*!< SGCL_EID specified for Update operation is in invalid.  */
    kNETC_SGIInvADMINBASETIME = 0x2C4U, /*!< ADMIN_BASE_TIME specified for Add or Update operation is more than 2^30ns
                                        in the past. */
    kNETC_SGIInvCYCLETIME = 0x2C5U,     /*!< Cumulated time value of CYCLE_TIME in Stream gate Control list plus
                                            CYCLE_TIME_EXT specified in Add or Update operation is >=2^30ns or
                                            CYCLE_TIME specified is 0. */
    /* Stream Gate Control List Table error status */
    kNETC_SGCLOverLength = 0x2D0U,       /*!< Number words required for the LIST_LENGTH specified for the Add operation
                                            exceeds the number of words allocated for SGCL table */
    kNETC_SGCLTimeIntervalZero = 0x2D1U, /*!< TIME_INTERVAL_GE_N specified in Add operation is 0. Note that upper
                            2 bits of TIME_INTERVAL_GE_N are ignored, TIME_INTERVAL_GE_N[29:0] must not be 0. */
    kNETC_SGCLTimeIntervalOverflow = 0x2D2U, /*!< Cumulated time value of TIME_INTERVAL_GE_N[29:0] for the gate list
                                                specified in Add operation is >= 2^30ns. */
    /* Frame Modification Table error status */
    kNETC_FMInvEMEID    = 0x300U, /*!< FM_EID format is invalid */
    kNETC_FMOptOutRange = 0x301U, /*!< Following fields specified are out of range - MAC_HDR_ACT, VLAN_HDR_ACT, SQT_ACT,
                                     OUTER_PCP_DEI_ACT, PLD_ACT. */
    kNETC_FMFMDOutRange = 0x302U, /*!< FMD_EID,FMD_BYTES specified is out of range. When FMD_EID is not set to Null,
                                     valid range is FMD_EID[15:0]*24 + FMD_BYTES <= (FMDITCAPR[NUM_WORDS]*24).*/
    /* Buffer Pool Table error status */
    kNETC_BPSBPEIDOutRange = 0x310U, /*!< SBP_EN is 1 and SBP_EID value is out-of-range in update command */
} netc_cmd_error_t;

/*! @brief The Switch/SI command BD data structure */
typedef union _netc_cmd_bd
{
    struct
    {
        uint64_t addr; /*!< The request and response data buffers address */
        struct
        {
            uint32_t resLength : 20; /*!< The length of the Response Data Buffer */
            uint32_t reqLength : 12; /*!< The length of the Request Data Buffer */
        };
        struct
        {
            netc_tb_cmd_t cmd : 4;                /*!< Access table entry command, see @ref netc_tb_cmd_t . */
            uint32_t : 8;
            netc_tb_access_mode_t accessType : 2; /*!< Access table entry method, see @ref netc_tb_access_mode_t. */
            uint32_t : 2;                         /*!< RSS Hash high field value. */
            netc_tb_index_t tableId : 8;
            uint32_t version : 6;                 /*!< Protocol Version. */
            uint32_t enCompInt : 1;               /*!< Command Completion Interrupt. */
            uint32_t resReady : 1;                /*!< Response Ready. */
        };
        uint32_t reserved[3];
        struct
        {
            uint32_t : 15;
            uint32_t npf : 1; /*!< NTMP Protocol Format. */
            uint32_t : 16;
        };
    } req;
    struct
    {
        uint32_t reserved1[3];
        struct
        {
            uint32_t numMatched : 16; /*!< Number of Entries Matched. */
            uint32_t error : 12;      /*!< Error status. */
            uint32_t : 3;
            uint32_t resReady : 1;    /*!< Response Ready. */
        };
        uint32_t reserved2[4];
    } resp;
    struct
    {
        uint64_t addr;          /*!< Data. */
        uint32_t : 31;
        uint32_t en : 1;        /*!< Enable entry. */
        uint32_t reserved[2];
        uint32_t siBitMap : 16; /*!< Station interfaces 15-0 for which this filter applies. */
        uint32_t : 16;
        uint32_t index : 16;    /*!< The index refers to an entry location within a table. */
        uint32_t length : 16;   /*!< NA */
        uint32_t cmd : 8;       /*!< Command. */
        uint32_t class : 8;     /*!< Class of command. */
        uint32_t : 8;
        uint32_t status : 6;    /*!< Status. */
        uint32_t ci : 1;        /*!< Completion interrupt. */
        uint32_t sf : 1;        /*!< Short format. */
    } generic;
} netc_cmd_bd_t;

/*! @brief Configuration for the Switch/SI command BD Ring Configuration */
typedef struct _netc_cmd_bdr_config
{
    netc_cmd_bd_t *bdBase; /*!< BDR base address which shall be 128 bytes aligned */
    uint16_t bdLength;     /*!< Size of BD ring which shall be multiple of 8 BD */
    bool enCompInt;        /*!< Enable/Disable command BD completion interrupt */
} netc_cmd_bdr_config_t;

/*! @brief The Switch/SI command BD ring handle data structure */
typedef struct _netc_cmd_bdr
{
    netc_cmd_bd_t *bdBase;  /*!< BDR base address which shall be 128 bytes aligned */
    uint16_t bdLength;      /*!< Size of BD ring */
    uint16_t producerIndex; /*!< Current index for execution. */
    uint16_t cleanIndex;    /*!< Current index for cleaning. */
    bool bdrEnable;         /*!< Current command BD ring is enable or not. */
} netc_cmd_bdr_t;

/*! @brief Table request data buffer common header */
typedef struct _netc_tb_common_header
{
    uint32_t updateActions : 16; /*!< Update Actions */
    uint32_t : 8;
    uint32_t queryActions : 4;   /*!< Query Actions */
    uint32_t : 4;
} netc_tb_common_header_t;

/*!
 * @brief Frame Modification VLAN Update/Delete Action
 * @note  Misconfiguration error if replace or delete action is specified and if VLAN tag is not present in frame.
 */
typedef enum _netc_fm_vlan_ud_act
{
    kNETC_NoUDVlanAction = 0U, /*!< No Update/Delete VLAN action */
    kNETC_ReplVlanPcpAndDei, /*!< Replace outer VLAN's PCP/DEI based on the port's PPCPDEIMR. The tag's original VID and
                                TPID are preserved */
    kNETC_DelVlan            /*!< Delete outer VLAN Tag */

} netc_fm_vlan_ud_act_t;

/*!
 * @brief Frame Modification Sequence Tag Action
 * @note Must be set to 000b for Ingress frame modification, otherwise misconfiguration error..
 */
typedef enum _netc_fm_sqt_act
{
    kNETC_NoSqtAction = 0U, /*!< No SQT action */
    kNETC_ReomveRTag /*!< Remove R-TAG/draft 2.0 R-TAG/HSR tag, If R-TAG/HSR tag not present, misconfiguration error. */
} netc_fm_sqt_act_t;

/*!
 * @brief Frame Modification VLAN Add/Replace Action
 * @note  For ingress frame modificaion with 00b or 01b, use the ingress port to select PCP and DEI from the Bridge port
 *        default VLAN register (BPDVR). For egress frame modification with 00b or 01b, use the internal QoS associated
 *        with the frame (IPV, DR) to access the QoS to PCP mapping profile (PQOSMR[QVMP] , QOSVLANMPaR0/1/2/3) to set
 *        the new PCP value. Use internal DR associated with frame to access the DR to DEI mapping profile
 *        (PPCPDEIMR[DRnDEI]) to set the new DEI value.
 */
typedef enum _netc_fm_vlan_ar_act
{
    kNETC_AddCVlanPcpAndDei = 0U, /*!< Add outer VLAN with VID and PCP/DEI updated as described above. TPID=0x8100 */
    kNETC_AddSVlanPcpAndDei,      /*!< Add outer VLAN with VID and PCP/DEI updated as described above. TPID=0x88A8 */
    kNETC_ReplVidOnly,            /*!< Replace VLAN with VID. The tag's original PCP, DEI and TPID are preserved */
    kNETC_ReplVidPcpAndDei        /*!< Replace VLAN with VID and PCP/DEI updated by port's PPCPDEIMR. The tag's original
                                 TPID is preserved */

} netc_fm_vlan_ar_act_t;

/*!
 * @brief Frame Modification Entry ID encode options
 * @note sqta should be netc_fm_sqt_act_t type, vuda should be netc_fm_vlan_ud_act_t type and vara should be
 *       netc_fm_vlan_ar_act_t type.
 */
#define NETC_FD_EID_ENCODE_OPTION_0(entryId) ((uint32_t)(entryId) & 0xFFFU)
#define NETC_FD_EID_ENCODE_OPTION_1(sqta, vuda) \
    ((((uint32_t)(sqta) & 0x7U) << 2U) | ((uint32_t)(vuda) & 0x3U) | 0x2000U)
#define NETC_FD_EID_ENCODE_OPTION_2(vara, vid) \
    ((((uint32_t)(vara) & 0x3U) << 12U) | ((uint32_t)(vid) & 0xFFFU) | 0x4000U)

/*!
 * @brief Define FDB/L2MCF/IS table entry access the primary Egress Treatment table entry group mode
 * @note  The FDB/L2 IPv4 Multicast filter table has precedence over any assignment made via the Ingress Stream table.
 *        For Mulit port mode, the index to access the Egress Treatment table is computed by adding an offset to the
 *        base index of the Egress Treatment group. That offset is derived from the applicability bitmap as follows:
 *        starting from the lowest significant bit of the bitmap, the first encountered bit set to 1, corresponds to
 *        offset 0, and so on. This continues till the destination port location in the bitmap is reached
 */
typedef enum _netc_tb_eteid_access_mode
{
    kNETC_NoETAccess = 0x0U,       /*!< No Egress Treatment table access */
    kNETC_SinglePortETAccess,      /*!< Only frame sent to a special port (define in ePort) can access a single Egress
                                    Treatment table entry, the applicability bitmap specified by FDB/L2MCF/IS ePort field
                                    */
    kNETC_MulitPortPackedETAccess, /*!< Only frames sent to a special set of ports (ports set to 1 in ePortBitmap) can
                                      access the Egress Treatment table, the applicability bitmap = IS ePortBitmap field
                                      or FDB/L2MCF portBitmap field */
    kNETC_MulitPortAbsETAccess     /*!< Frames sent to all of ports can access the Egress Treatment table, means the
                                      applicability bitmap is set with 1 for all ports */
} netc_tb_eteid_access_mode_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Port Filter Table
#endif

/*! @brief Ingress Port Filter Table Update Actions */
typedef enum _netc_tb_ipf_update_action
{
    kNETC_IPFCfgEUpdate = 0x1U, /*!< Configuration Element Update */
    kNETC_IPFStsEUpdate = 0x2U  /*!< Statistics Element Update */
} netc_tb_ipf_update_action_t;

/*! @brief Ingress Port Filter frame attribute mask */
typedef enum _netc_tb_ipf_attr_mask
{
    kNETC_IPFSwtPortMasMask = 0x1U,   /*!<  Switch port masquerading Mask */
    kNETC_IPFEthernetMask   = 0x2U,   /*!< Ethernet type Mask */
    kNETC_IPFOuterVlanMask  = 0x4U,   /*!< Outer VLAN Mask */
    kNETC_IPFInnerVlanMask  = 0x8U,   /*!< Inner VLAN Mask */
    kNETC_IPFSeqTagMask     = 0x70U,  /*!< Sequence Tag Code Mask */
    kNETC_IPFIpHeaderMask   = 0x80U,  /*!< IP Header Mask */
    kNETC_IPFIpVersionMask  = 0x100U, /*!< IP Version Mask */
    kNETC_IPFIpExtMask      = 0x200U, /*!< IPv4 option / IPv6 extension Mask */
    kNETC_IPFL4HeaderMask   = 0xC00U, /*!< L4 Code Mask */
    kNETC_IPFWakeOnLanMask  = 0x1000U /*!< Wake-on-LAN Magic Packet Mask */
} netc_tb_ipf_attr_mask_t;

