tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Ingress Port Filter frame attribute Sequence Tag Code */
typedef enum _netc_tb_ipf_seq_tag
{
    kNETC_IPFNoRtag = 0x0U, /*!<  R-TAG/HSR tag is not present */
    kNETC_IPFDraftRtag,     /*!< 802.1CB draft 2.0 R-TAG is present */
    kNETC_IPFRtag,          /*!< 802.1CB R-TAG is present */
    kNETC_IPFHsrTag         /*!< HSR Tag is present */
} netc_tb_ipf_seq_tag_t;

/*! @brief Ingress Port Filter frame attribute L4 Header Code */
typedef enum _netc_tb_ipf_l4_header
{
    kNETC_IPFOtherL4 =
        0x0U,     /*!< The L4 Header is considered as other L4 if it is not one of the following L4 Headers */
    kNETC_IPFTcp, /*!< TCP header is present */
    kNETC_IPFUdp, /*!< UDP header is present */
    kNETC_IPFSctp /*!< SCTP header is present */
} netc_tb_ipf_l4_header_t;

/*! @brief Ingress Port Filter key element */
typedef struct _netc_tb_ipf_keye
{
    uint16_t precedence; /*!< Precedence value of an entry*/
    uint8_t res0[6];
    struct
    {
        uint16_t swtPortMas : 1; /*!< Switch port masquerading, applicable only if the incoming port is designated
                                    as a switch management port */
        uint16_t ethernet : 1;   /*!< Ethernet type Present */
        uint16_t outerVlan : 1;  /*!< Outer VLAN Present */
        uint16_t innerVlan : 1;  /*!< Inner VLAN Present */
        netc_tb_ipf_seq_tag_t seqTag : 3;     /*!<  Sequence Tag Code */
        uint16_t ipHeader : 1;                /*!<  IP Header Present */
        uint16_t ipVersion : 1;               /*!< 0b = IPv4, 1b = IPv6 */
        uint16_t ipExt : 1;                   /*!< IPv4 option / IPv6 extension present */
        netc_tb_ipf_l4_header_t l4Header : 2; /*!< L4 Header code */
        uint16_t wakeOnLan : 1;               /*!< Wake-on-LAN Magic Packet Present */
        uint16_t : 3;
    } frameAttr;                              /*!< Frame Attribute flags */
    uint16_t frameAttrMask;                   /*!< Frame attribute mask, set with OR of @ref netc_tb_ipf_attr_mask_t */
    uint16_t dscp : 6;                        /*!< Differentiated Services Code Point */
    uint16_t dscpMask : 6;                    /*!< Differentiated Services Code Point Mask */
    uint16_t res1 : 4;
    uint16_t srcPort : 5;                     /*!< Source Port ID */
    uint16_t srcPortMask : 5;                 /*!< Source Port ID Mask */
    uint16_t res2 : 6;
    uint16_t outerVlanTCI;                    /*!< Outer VLAN Tag Control Information */
    uint16_t outerVlanTCIMask;                /*!< Outer VLAN Tag Control Information Mask */
    uint8_t dmac[6];                          /*!< Destination MAC Address */
    uint8_t dmacMask[6];                      /*!< Destination MAC Address Mask */
    uint8_t smac[6];                          /*!< Source MAC Address */
    uint8_t smacMask[6];                      /*!< Source MAC Address Mask */
    uint16_t innerVlanTCI;                    /*!< Inner VLAN Tag Control Information */
    uint16_t innerVlanTCIMask;                /*!< Inner VLAN Tag Control Information Mask */
    uint16_t etherType;                       /*!< 2-byte EtherType */
    uint16_t etherTypeMask;                   /*!< EtherType Mask */
    uint8_t IPProtocol;                       /*!< IP Protocol */
    uint8_t IPProtocolMask;                   /*!< IP Protocol Mask */
    uint8_t res3[14];
    uint8_t srcIPAddr[16]; /*!< IP Source Address, Bits 127-0: IPv6 source address, Bits 127-96: IPv4 source address */
    uint8_t res4[8];
    uint8_t srcIPAddrMask[16];  /*!< IP Source Address Mask */
    uint16_t l4SrcPort;         /*!< L4 Source Port */
    uint16_t l4SrcPortMask;     /*!< L4 Source Port Mask */
    uint8_t res5[4];
    uint8_t destIPAddr[16];     /*!< IP Destination Address, Bits 127-0: IPv6 source address, Bits 127-96: IPv4 source
                                   address */
    uint8_t res6[8];
    uint8_t destIPAddrMask[16]; /*!< IP Destination Address Mask*/
    uint16_t l4DestPort;        /*!< L4 Destination Port */
    uint16_t l4DestPortMask;    /*!< L4 Destination Port Mask */
    uint8_t res7[4];
    struct
    {
        uint8_t data; /*!< Payload Byte n */
        uint8_t mask; /*!< Payload Byte n  Mask */
    } payload[24];
} netc_tb_ipf_keye_t;

/*! @brief Ingress port filter forwarding Action */
typedef enum _netc_tb_ipf_forward_action
{
    kNETC_IPFForwardDiscard = 0U, /*!< Frame be discard */
    kNETC_IPFForwardPermit,       /*!< Frame be permit */
    kNETC_IPFRedirectToMgmtPort,  /*!< Redirect frame to switch management port without any frame modification, Switch
                                    only */
    kNETC_IPFCopyToMgmtPort /*!< Copy frame to switch management port without any frame modification, Switch only */
} netc_tb_ipf_forward_action_t;

/*! @brief Ingress port filter Filter Action */
typedef enum _netc_tb_ipf_filter_action
{
    kNETC_IPFNoAction = 0U,     /*!< No action */
    kNETC_IPFWithRatePolicer,   /*!< Rate action with the Rate Policer Entry ID (RP_EID) set to the value configured in
                                   the fltaTgt field */
    kNETC_IPFWithIngressStream, /*!< Ingress stream identification action where the Ingress Stream Entry ID (IS_EID) is
                                   set to the value configured in the fltaTgt field */
    kNETC_IPFWithL2Filtering    /*!< Setting a pre L2 filtering SI bitmap (set to the value configured in the fltaTgt)
                                   that will be used by the L2 filtering function to determine the final SI bitmap, ENETC
                                   only */
} netc_tb_ipf_filter_action_t;

/*! @brief Ingress port filter config element */
typedef struct _netc_tb_ipf_cfge
{
    uint32_t ipv : 4;                       /*!< Internal Priority Value */
    uint32_t oipv : 1;                      /*!< Overwrite IPV */
    uint32_t dr : 2;                        /*!< Drop Resilience */
    uint32_t odr : 1;                       /*!< Overwrite DR */
    netc_tb_ipf_forward_action_t fltfa : 2; /*!< Filter Forwarding action. */
    uint32_t : 1;
    uint32_t imire : 1;                     /*!< Ingress Mirroring Enable */
    uint32_t wolte : 1;                     /*!< Wake-onLAN trigger enable */
    netc_tb_ipf_filter_action_t flta : 2;   /*!< FIlter Action. */
    uint32_t rpr : 2;                       /*!< Relative Precedent Resolution */
    uint32_t ctd : 1;                       /*!< Cut through disable. */
    netc_host_reason_t hr : 4;              /*!< Host Reason metadata when frame is redirected/copied to
                                              the switch management port */
    uint32_t timecape : 1;                  /*!< Timestam capture enable */
#if defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG
    uint32_t rrt : 1;                       /*!< Report Receive Timestamp */
    uint32_t : 8;
#else
    uint32_t : 9;
#endif
    uint32_t fltaTgt;                       /*!< Target for selected switch forwarding action or filter action*/
} netc_tb_ipf_cfge_t;

