tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Ingress Stream table request data buffer */
typedef struct _netc_tb_is_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_is_cfge_t cfge; /*!< Only perform for update or add command */
} netc_tb_is_req_data_t;

/*! @brief Ingress Stream table request response data buffer */
typedef struct _netc_tb_is_rsp_data
{
    uint32_t entryID;       /*!< Only perform for query command */
    netc_tb_is_cfge_t cfge; /*!< Only perform for query command */
} netc_tb_is_rsp_data_t;

/*! @brief Ingress Stream table data buffer */
typedef struct _netc_tb_is_data
{
    union
    {
        netc_tb_is_req_data_t request;
        netc_tb_is_rsp_data_t response;
    };
} netc_tb_is_data_t;

/*! @brief Ingress Stream table entry config */
typedef struct _netc_tb_is_config
{
    uint32_t entryID;
    netc_tb_is_cfge_t cfge;
} netc_tb_is_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Stream Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Stream Filter Table
#endif

/*! @brief Ingress Stream Filter table key element */
typedef struct _netc_tb_isf_keye
{
    uint32_t isEID;  /*!< Ingress Stream Entry ID */
    uint8_t pcp : 3; /*!< Priority Code Point, Outer VLAN TAG PCP of the received frame */
    uint8_t : 5;
} netc_tb_isf_keye_t;

/*! @brief Ingress Stream Filter table config element */
typedef struct _netc_tb_isf_cfge
{
    uint32_t ipv : 4;      /*!< Internal Priority Value, active when opiv is set to 1 */
    uint32_t oipv : 1;     /*!< Override internal priority value */
    uint32_t dr : 2;       /*!< Drop Resilience, active when odr is set to 1 */
    uint32_t odr : 1;      /*!< Overwrite DR */
    uint32_t imire : 1;    /*!< Ingress Mirroring Enable, not applicable to ENETC */
    uint32_t timecape : 1; /*!< Timestamp Capture Enable, not applicable to ENETC */
    uint32_t osgi : 1;     /*!< Override stream gate instance entry id */
    uint32_t ctd : 1;      /*!< Cut-Through Disable, will disable cut-through for all destined ports when set 1, not
                              applicable to ENETC */
    uint32_t orp : 1;      /*!< Override Rate Policer (instance) ID */
    netc_tc_sdu_type_t sduType : 2; /*!< Service Data Unit Type to user for MSDU */
    uint32_t : 1;
    uint32_t msdu : 16;             /*!< Maximum Service Data Unit */
    uint32_t rpEID;                 /*!< Rate Policer Entry ID, Valid when orp =1. 0xFFFF_FFFF is NULL */
    uint32_t sgiEID;                /*!< Stream Gate Instance Entry ID, Valid when osgi =1. 0xFFFF_FFFF is NULL */
    uint32_t iscEID;                /*!< Ingress Stream counter Index. 0xFFFF_FFFF is NULL. */
} netc_tb_isf_cfge_t;

/*! @brief Ingress Stream Filter table request data buffer */
typedef struct _netc_tb_isf_req_data
{
    netc_tb_common_header_t commonHeader;
    union
    {
        uint32_t entryID;
        uint32_t sCriteria;
        netc_tb_isf_keye_t keye;
    };
    netc_tb_isf_cfge_t cfge; /*!< Only perform for update or add command */
} netc_tb_isf_req_data_t;

/*! @brief Ingress Stream Filter table request response data buffer */
typedef struct _netc_tb_isf_rsp_data
{
    uint32_t status;
    uint32_t entryID;        /*!< Only perform for query command */
    netc_tb_isf_keye_t keye; /*!< Only perform for query command */
    netc_tb_isf_cfge_t cfge; /*!< Only perform for query command */
} netc_tb_isf_rsp_data_t;

/*! @brief Ingress Stream Filter table data buffer */
typedef struct _netc_tb_isf_data
{
    union
    {
        netc_tb_isf_req_data_t request;
        netc_tb_isf_rsp_data_t response;
    };
} netc_tb_isf_data_t;

/*! @brief Ingress Stream Filter table entry config */
typedef struct _netc_tb_isf_config
{
    netc_tb_isf_keye_t keye;
    netc_tb_isf_cfge_t cfge;
} netc_tb_isf_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Stream Filter Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Rate Policer Table
#endif

/*! @brief Rate Policer Table Update Actions */
typedef enum _netc_tb_rp_update_action
{
    kNETC_RPCfgEUpdate = 0x1U, /*!< Configuration Element Update */
    kNETC_RPFeEUpdate  = 0x2U, /*!< Functional Enable Element Update */
    kNETC_RPPsEUpdate  = 0x4U, /*!< Policer State Element Update Element Update */
    kNETC_RPStsEUpdate = 0x8U  /*!< Statistics Element Update */
} netc_tb_rp_update_action_t;

/*! @brief Rate Policer Table Protocol/Service Data Unit Type */
typedef netc_tc_sdu_type_t netc_tb_rp_sdu_type_t;

/*! @brief Rate Policer table config element */
typedef struct _netc_tb_rp_cfge
{
    uint32_t cir;      /*!< Committed information Rate */
    uint32_t cbs;      /*!< Commited Burst Size */
    uint32_t eir;      /*!< Excess information Rate */
    uint32_t ebs;      /*!< Excess Burst Size */
    uint32_t mren : 1; /*!< Mark All Frames Red Enable, Not valid when ndor=1 */
    uint32_t doy : 1;  /*!< Drop on Yellow enable */
    uint32_t cm : 1;   /*!< Color mode, 0b = Color blind, 1b = Color aware */
    uint32_t cf : 1;   /*!< Coupling flag, enables coupling the Committed (C) bucket and Excess (E) bucket */
    uint32_t ndor : 1; /*!< No drop on red */
    netc_tb_rp_sdu_type_t sduType : 2; /*!< Service Data Unit Type */
    uint32_t : 25;                     /*!< Reserved */
} netc_tb_rp_cfge_t;

/*! @brief Rate Policer table Function Enable element */
typedef struct _netc_tb_rp_fee
{
    uint8_t fen : 1; /*!< Function Enable */
    uint8_t : 7;     /*!< Reserved */
} netc_tb_rp_fee_t;

/*! @brief Rate Policer table Policer State element */
typedef struct _netc_tb_rp_pse
{
    uint8_t mr : 1;   /*!< Mark Red Flag */
    uint8_t res0 : 7; /*!< Reserved */
} netc_tb_rp_pse_t;

/*! @brief Rate Policer table statistic element */
typedef struct _netc_tb_rp_stse
{
    uint32_t byteCount[2];       /*!< Number of bytes received by the rate policer instance */
    uint32_t dropFrames[2];      /*!< Number of frames dropped by the rate policer instance */
    uint32_t dr0GrnFrames[2];    /*!< Number of frames marked green with DR=0 by the rate policer instance */
    uint32_t dr1GrnFrames[2];    /*!< Number of frames marked green with DR=1 by the rate policer instance */
    uint32_t dr2GrnFrames[2];    /*!< Number of frames marked yellow with DR=2 by the rate policer instance */
    uint32_t remarkYlwFrames[2]; /*!< Number of frames re-marked from green to yellow by the rate policer instance */
    uint32_t dr3RedFrames[2];    /*!< Number of frames marked red with DR=3 by the rate policer instance */
    uint32_t
        remarkRedFrames[2]; /*!< Number of frames re-marked from green or yellow to red by the rate policer instance */
    uint32_t lts;           /*!< Last timestamp */
    uint32_t bci : 31;      /*!< Committed token bucket contents, integer portion (31 bits) */
    uint32_t bcs : 1;       /*!< Committed token bucket sign bit (1 bit) */
    uint32_t bcf;           /*!< Committed token bucket contents, fractional portion (31 bits) */
    uint32_t bei;           /*!< Excess token bucket contents, integer portion (32 bits) */
    uint32_t bef : 31;      /*!< Excess token bucket contents, fractional portion (31 bits) */
    uint32_t bes : 1;       /*!< Committed token bucket sign bit */
} netc_tb_rp_stse_t;

/*! @brief Rate Policer table request data buffer */
typedef struct _netc_tb_rp_req_data
{
    netc_tb_common_header_t commonHeader; /* Common header, contains Update Actions and Query Actions */
    uint32_t entryID;                     /* Access Key, activer when use Entry ID Match */
    union
    {
        netc_tb_rp_cfge_t cfge; /*!< Present only for commands which perform an update or add */
        struct
        {
            uint8_t reserved[18];
            netc_tb_rp_fee_t fee; /*!< Present only for commands which perform an update or add */
        };
    };
} netc_tb_rp_req_data_t;

/*! @brief Rate Policer table request response data buffer */
typedef struct _netc_tb_rp_rsp_data
{
    uint32_t entryID;       /*!< Present only for commands which perform a query */
    netc_tb_rp_stse_t stse; /*!< Present only for commands which perform a query */
    union
    {
        netc_tb_rp_cfge_t cfge; /*!< Present only for commands which perform a query */
        struct
        {
            uint8_t reserved1[18];
            netc_tb_rp_fee_t fee; /*!< Present only for commands which perform a query */
            uint8_t reserved2;
        };
        struct
        {
            uint8_t reserved3[19];
            netc_tb_rp_pse_t pse; /*!< Present only for commands which perform a query */
        };
    };
} netc_tb_rp_rsp_data_t;

/*! @brief Rate Policer table data buffer */
typedef struct _netc_tb_rp_data
{
    union
    {
        netc_tb_rp_req_data_t request;
        netc_tb_rp_rsp_data_t response;
    };
} netc_tb_rp_data_t;

