tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Rate Policer table entry config */
typedef struct _netc_tb_rp_config
{
    uint32_t entryID;
    netc_tb_rp_cfge_t cfge;
    netc_tb_rp_fee_t fee;
} netc_tb_rp_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Rate Policer Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Stream Count Table
#endif

/*! @brief Ingress Stream Count table statistic element */
typedef struct _netc_tb_isc_stse
{
    uint32_t rxCount;          /*!< Receive Count */
    uint32_t res0;
    uint32_t msduDropCount;    /*!< MSDU Drop Count */
    uint32_t res1;
    uint32_t policerDropCount; /*!< Policer Drop Count */
    uint32_t res2;
    uint32_t sgDropCount;      /*!< Stream Gating Drop Count */
    uint32_t res3;
} netc_tb_isc_stse_t;

/*! @brief Ingress Stream Count table request data buffer */
typedef struct _netc_tb_isc_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
} netc_tb_isc_req_data_t;

/*! @brief Ingress Stream Count table request response data buffer */
typedef struct _netc_tb_isc_rsp_data
{
    uint32_t entryID;
    netc_tb_isc_stse_t stse;
} netc_tb_isc_rsp_data_t;

/*! @brief Ingress Stream Count table data buffer */
typedef struct _netc_tb_isc_data
{
    union
    {
        netc_tb_isc_req_data_t request;
        netc_tb_isc_rsp_data_t response;
    };
} netc_tb_isc_data_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Stream Count Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Stream Gate Instance Table
#endif

/*! @brief Stream Gate Instance table Update Actions */
typedef enum _netc_tb_sgi_update_action
{
    kNETC_SGIAcfEUpdate  = 0x1U, /*!< Admin Configuration Element  */
    kNETC_SGICfgEUpdate  = 0x2U, /*!< Configuration Element Update */
    kNETC_SGISgisEUpdate = 0x4U  /*!< Stream Gate Instance State Element Update */
} netc_tb_sgi_update_action_t;

/*! @brief Stream Gate Instance table Protocol/Service Data Unit Type */
typedef netc_tc_sdu_type_t netc_tb_sgi_sdu_type_t;

/*! @brief Stream Gate Instance State */
typedef enum _netc_tb_sgi_state
{
    kNETC_GSNotOper = 0x0U,  /*!< Gate instance is not operational or Gate instance and lists are not valid */
    kNETC_GSUseDefaultParam, /*!< Gate instance is operational but no stream gate control list specified, use default
                                Gate Instance parameters */
    kNETC_GSUseDefUntilAdminAct,  /*!<  Use default Gate Instance parameters until administrative stream gate control
                                     list takes effect */
    kNETC_GSUseOperUntilAdminAct, /*!< Use Operational stream gate control list until new administrative stream gate
                                     control list takes effect */
    kNETC_GSUseOperList           /*!< Operational stream gate control list is in effect */
} netc_tb_sgi_state_t;

/*! @brief Stream Gate Instance table config element */
typedef struct _netc_tb_sgi_cfge
{
    uint8_t oexen : 1;                  /*!< Octets Exceeded (Gate Closed Due To Octets Exceeded function) Enable */
    uint8_t irxen : 1;                  /*!< Invalid Receive (Gate Closed Due To Invalid Rx) Enable */
    netc_tb_sgi_sdu_type_t sduType : 2; /*!< The type of PDU/SDU for Interval Octets Maximum check for Gate Entry */
    uint8_t : 4;
} netc_tb_sgi_cfge_t;

/*! @brief Stream Gate Instance table Admin Configuration element */
typedef struct _netc_tb_sgi_acfge
{
    uint32_t adminSgclEID;      /*!< Administrative Stream Gate Control List Entry ID, 0xFFFFFFFF is NULL */
    uint32_t adminBaseTime[2];  /*!< Admin Base Time */
    uint32_t adminCycleTimeExt; /*!< Admin Cycle Time Extension */
} netc_tb_sgi_acfge_t;

/*! @brief Stream Gate Instance table Initial Configuration element */
typedef struct _netc_tb_sgi_icfge
{
    uint8_t ipv : 4;  /*!< Internal Priority Value (IPV), Valid if oipv is 1 */
    uint8_t oipv : 1; /*!< Override frame IPV, otherwise the IPV value is determined by the stream gate control list
                          entry */
    uint8_t gst : 1;  /*!< Specifies Gate State before the administrative stream gate control list takes affect, 0b =
                         Closed; 1b = Open */
    uint8_t ctd : 1;  /*!< Specifies Cut Through disable status before the administrative stream gate control list takes
                          affect , Not applicable to ENETC function*/
    uint8_t : 1;
} netc_tb_sgi_icfge_t;

/*! @brief Stream Gate Instance table stream gate instance state element */
typedef struct _netc_tb_sgi_sgise
{
    uint32_t operSgclEID;          /*!< Operational Stream Gate Control List Entry ID */
    uint32_t configChangeTime[2];  /*!< Configuration Change Time */
    uint32_t operBaseTime[2];      /*!< Operational Base Time */
    uint32_t operCycleTimeExt;     /*!< Oper Cycle Time Extension */
    uint32_t oex : 1;              /*!< Octets Exceeded Flag */
    uint32_t irx : 1;              /*!< Invalid Receive Flag */
    netc_tb_sgi_state_t state : 3; /*!< Current Gate Instance State */
    uint32_t : 27;
} netc_tb_sgi_sgise_t;

/*! @brief Stream Gate Instance table request data buffer */
typedef struct _netc_tb_sgi_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_sgi_acfge_t acfge;
    netc_tb_sgi_cfge_t cfge;
    netc_tb_sgi_icfge_t icfge;
} netc_tb_sgi_req_data_t;

/*! @brief Stream Gate Instance table request response data buffer */
typedef struct _netc_tb_sgi_rsp_data
{
    uint32_t entryID;
    union
    {
        netc_tb_sgi_sgise_t sgise;
        struct
        {
            uint8_t res0[25];
            netc_tb_sgi_cfge_t cfge;
            netc_tb_sgi_icfge_t icfge;
            uint8_t res1;
        };
    };
    netc_tb_sgi_acfge_t acfge;
} netc_tb_sgi_rsp_data_t;

/*! @brief Stream Gate Instance table data buffer */
typedef struct _netc_tb_sgi_data
{
    union
    {
        netc_tb_sgi_req_data_t request;
        netc_tb_sgi_rsp_data_t response;
    };
} netc_tb_sgi_data_t;

/*! @brief Stream Gate Instance table entry config */
typedef struct _netc_tb_sgi_config
{
    uint32_t entryID;
    netc_tb_sgi_acfge_t acfge;
    netc_tb_sgi_cfge_t cfge;
    netc_tb_sgi_icfge_t icfge;
} netc_tb_sgi_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Stream Gate Instance Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Stream Gate Control List Table
#endif
/*! @brief Stream Gate Control List Table maximum gate control list length */
#define NETC_TB_SGCL_MAX_ENTRY (0x100U)

