tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Defines the Stream Gate Control entry structure. */
typedef struct _netc_sgcl_gate_entry
{
    uint32_t timeInterval; /*!< Time Interval for Gate Entry */
    uint32_t iom : 24;     /*!< Interval Octets Maximum for Gate Entry, specifies the maximum bytes (octets) allowed to
                              pass (open), valid if iomen = 1 */
    uint32_t ipv : 4;      /*!< Internal Priority Value for Gate Entry */
    uint32_t oipv : 1;     /*!< Override Internal Priority Value for Gate Entry */
    uint32_t ctd : 1;      /*!< Cut Through Disable for Gate Entry */
    uint32_t iomen : 1;    /*!< Interval Octet Maximum Enabled for Gate Entry, 0b = Don'track count, 1b = Track count */
    uint32_t gtst : 1;     /*!< Gate State for Gate Entry, 0b = Closed; 1b = Open  */
} netc_sgcl_gate_entry_t;

/*! @brief Stream Gate Control List table config element */
typedef struct _netc_tb_sgcl_cfge
{
    uint32_t cycleTime;   /*!< Cycle Time */
    uint8_t listLength;   /*!< List Length */
    uint8_t res0;
    uint16_t extOipv : 1; /*!< Extension (means the stream gate control list ends and before cycleTime restarts)
                             Override Internal Priority Value */
    uint16_t extIpv : 4;  /*!< List Extension Internal Priority Value, valid if extOipv = 1 */
    uint16_t extCtd : 1;  /*!< Extension Cut Through Disabled, 0b = No action, 1b = Disabled */
    uint16_t extGtst : 1; /*!< Extension Gate State, 0b = closed, 1b = Open */
    uint16_t res1 : 9;
    netc_sgcl_gate_entry_t ges[];
} netc_tb_sgcl_cfge_t;

/*! @brief Stream Gate Control List table Stream Gate Control List State element */
typedef struct _netc_tb_sgcl_sgclse
{
    uint8_t refCount; /*!< Reference Count, 1 indicates that the gate control list is an administrative or an
                         operational gate control list in a stream gate instance  */
} netc_tb_sgcl_sgclse_t;

/*! @brief Stream Gate Control List table request data buffer */
typedef struct _netc_tb_sgcl_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_sgcl_cfge_t cfge;
} netc_tb_sgcl_req_data_t;

/*! @brief Stream Gate Control List table request response data buffer */
typedef struct _netc_tb_sgcl_rsp_data
{
    uint32_t entryID;
    netc_tb_sgcl_sgclse_t sgclse;
    uint8_t res[3];
    netc_tb_sgcl_cfge_t cfge;
} netc_tb_sgcl_rsp_data_t;

/*! @brief Stream Gate Control List table data buffer */
typedef struct _netc_tb_sgcl_data
{
    union
    {
        netc_tb_sgcl_req_data_t request;
        netc_tb_sgcl_rsp_data_t response;
        struct
        {
            uint32_t rel0[4];
            netc_sgcl_gate_entry_t res1[NETC_TB_SGCL_MAX_ENTRY];
        };
    };
} netc_tb_sgcl_data_t;

/*! @brief Stream Gate Control List table entry gate control list structure */
typedef struct _netc_tb_sgcl_gcl
{
    uint16_t entryID;
    uint16_t extOipv : 1; /*!< Extension (means the stream gate control list ends and before cycleTime restarts)
                             Override Internal Priority Value */
    uint16_t extIpv : 4;  /*!< List Extension Internal Priority Value, valid if extOipv = 1 */
    uint16_t extCtd : 1;  /*!< Extension Cut Through Disabled, 0b = No action, 1b = Disabled */
    uint16_t extGtst : 1; /*!< Extension Gate State, 0b = closed, 1b = Open */
    uint32_t cycleTime;   /*!< Cycle Time */
    uint32_t numEntries;  /*!< Control List entry numbers */
    netc_sgcl_gate_entry_t *gcList; /*!< Pointer to stream gate control list array */
} netc_tb_sgcl_gcl_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Stream Gate Control List Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Frame Modification Table
#endif

/*!
 * @brief Frame Modification table Layer 2 Actions
 * @note  This field must be set to 0 for traffic destined to a pseudo link.
 *        This field must be set to 0 for any device with ASIL-B safety requirements.
 */
typedef enum _netc_tb_fm_layer2_act
{
    kNETC_UseL2HeaderAct = 0U, /*!< L2 actions are specified in L2 header action fields macHdrAct,
                                    vlanHdrAct and sqtAct */
    kNETC_UseSpecPlayload /*!< The entire L2 PDU is replaced with fmdBytes of data specified in fmdEID, not applicable
                             for ingress frame modifications */
} netc_tb_fm_layer2_act_t;

/*!
 * @brief Frame Modification table Layer 2 Header MAC Actions
 * @note Ingress frame modifications only support kNETC_NoAction or kNETC_ReplDmac.
 */
typedef enum _netc_tb_fm_mac_header_act
{
    kNETC_NoMacAction = 0U, /*!< No Mac header action */
    kNETC_ReplSmac    = 2U, /*!< Replace SMAC with the contents of the port's PMAR0/1 register, The port is specified by
                                       smacPort field */
    kNETC_ReplSmacAndDmacAct1, /*!< Replace SMAC and DMAC, The content of SMAC is the same as kNETC_ReplaceSMAC, the
                                      DMAC is specified by dmac[6] field */
    kNETC_ReplSmacAndDmacAct2, /*!< Replace SMAC and DMAC, The content of SMAC is the same as kNETC_ReplaceSMAC, the
                                      DMAC is specified by frame's SMAC */
    kNETC_ReplDmac,            /*!< Replace DMAC with specified dmac[6] field value */
    kNETC_SwapDmacAndSmac      /*!< Swap DMAC and SMAC */
} netc_tb_fm_mac_header_act_t;

/*!
 * @brief Frame Modification table Layer 2 VLAN Actions
 * @note For use Delete or Replace action, if no outer VLAN header is present, then a misconfiguration event will be
 *       generated and handled according to the port's PFMCR register.
 */
typedef enum _netc_tb_fm_vlan_header_act
{
    kNETC_NoVlanAction = 0U, /*!< No VLAN header action */
    kNETC_DelOuterVlan,      /*!< Delete outer VLAN header */
    kNETC_AddOuterVlan, /*!< Add outer VLAN header (new VLAN data will be inserted in the outer position), the VID, PCP,
                          DEI and TPID values are specified by outerVidAct, outerPcpAct, outerDeiAct and outerTpidAct
                          field */
    kNETC_ReplOuterVlan /*!< Replace outer VLAN header, the VID, PCP, DEI and TPID values are specified by outerVidAct,
                          outerPcpAct, outerDeiAct and outerTpidAct field */
} netc_tb_fm_vlan_header_act_t;

/*!
 * @brief Frame Modification table Layer 2 outer VLAN VID Actions
 * @note For use kNETC_UseFrameVID action, if no outer VLAN header is present, then a misconfiguration event will be
 *       generated and handled according to the port's PFMCR register.
 */
typedef enum _netc_tb_fm_outer_vid_act
{
    kNETC_UseFrameVid = 0U, /*!< Use the VID from the valid outer VLAN header of the received frame */
    kNETC_UseSpecVid        /*!< Use the VID specified in the outerVlanID field */
} netc_tb_fm_outer_vid_act_t;

/*!
 * @brief Frame Modification table Sequence Tag Action
 * @note For use kNETC_ReomveTag action, If R-TAG/draft 2.0 R-TAG/HSR tag not present, then a misconfiguration event
 * will be generated and handled according to the port's PFMCR register.
 */
typedef netc_fm_sqt_act_t netc_tb_fm_sqt_act_t;

/*!
 * @brief Frame Modification table Outer TPID action
 * @note For use kNETC_UseFrameTpid action, If outer VLAN header not present, then a misconfiguration event will be
 *       generated and handled according to the port's PFMCR register.
 */
typedef enum _netc_tb_fm_outer_tpid_act
{
    kNETC_UseFrameTpid = 0U, /*!< Use TPID from outer VLAN header */
    kNETC_UseStdCVlan,       /*!< Set TPID to Standard C-VLAN 0x8100 */
    kNETC_UseStdSVlan,       /*!< Set TPID to Standard S-VLAN 0x88A8 */
    kNETC_UseCustomCVlan,    /*!< Set TPID to Custom C-VLAN as defined by CVLANR1[ETYPE] */
    kNETC_UseCustomSVlan     /*!< Set TPID to Custom S-VLAN as defined by CVLANR2[ETYPE] */
} netc_tb_fm_outer_tpid_act_t;

/*!
 * @brief Frame Modification table Outer PCP action
 * @note For use kNETC_UseFramePcp/kNETC_UseFramePcpMap action, If outer VLAN header not present, then a
 * misconfiguration event will be generated and handled according to the port's PFMCR register.
 */
typedef enum _netc_tb_fm_outer_pcp_act
{
    kNETC_UseFramePcp = 0U, /*!< Use PCP from frame outer VLAN header */
    kNETC_UseSpecPcp,       /*!< Use the PCP specified in the outerVlanPcp field */
    kNETC_UseFramePcpMap,   /*!< The PCP is mapping from frame outer VLAN PCP (do mapping according to the PCP to PCP
                               mapping profile which specified in PPCPDEIMR[IPCPMP/EPCPMP]) */
    kNETC_UseQosMap /*!< The PCP is mapping from internal QoS (IPV, DR) (do mapping according to the QOS to PCP mapping
                    profile which specified in QOSVLANMPaR0/1/2/3), not applicable for ingress frame modifications */
} netc_tb_fm_outer_pcp_act_t;

/*!
 * @brief Frame Modification table Outer DEI action
 * @note For use kNETC_UseFrameDei action, If outer VLAN header not present, then a misconfiguration event will be
 *       generated and handled according to the port's PFMCR register.
 */
typedef enum _netc_tb_fm_outer_dei_act
{
    kNETC_UseFrameDei = 0U, /*!< Use DEI from frame outer VLAN header */
    kNETC_UseSpecDei,       /*!< Use the DEI specified in the outerVlanDei field */
    kNETC_UseDrMap          /*!< The DEI is mapping from internal DR (do mapping according to the DR to DEI mapping
                             profile which specified in PPCPDEIMR[DRnDEI], not applicable for ingress frame modifications */
} netc_tb_fm_outer_dei_act_t;

/*!
 * @brief Frame Modification table Payload Actions
 * @note  This field must be set to 0 for traffic destined to a pseudo link.
 *        This field must be set to 0 for any device with ASIL-B safety requirements.
 */
typedef enum _netc_tb_fm_payload_act
{
    kNETC_NoAction = 0U,    /*!< No Action */
    kNETC_ReplAllEthPld,    /*!< Remove entire Ethernet payload and insert with fmdBytes of data specified in fmdEID */
    kNETC_ReplPldWithOffset /*!< Replace fmdBytes of raw data in the Ethernet payload starting at pldOffset, data
                               specified in fmdEID */
} netc_tb_fm_payload_act_t;

/*! @brief Frame Modification table config element */
typedef struct _netc_tb_fm_cfge
{
    netc_tb_fm_layer2_act_t l2Act : 1;           /*!< Layer 2 Actions */
    netc_tb_fm_mac_header_act_t macHdrAct : 3;   /*!< Layer 2 Header MAC Actions */
    netc_tb_fm_vlan_header_act_t vlanHdrAct : 2; /*!< Layer 2 VLAN Actions */
    netc_tb_fm_outer_vid_act_t outerVidAct : 2;  /*!< Outer VID Actions */
    netc_tb_fm_sqt_act_t sqtAct : 3; /*!< Sequence Tag Action, Not applicable for ingress frame modifications */
    uint16_t smacPort : 5;           /*!< Source MAC Address Register Port, valid if macHdrAct=010b,011b,100b */
    uint8_t dmac[6];                 /*!< Destination MAC Address, valid if macHdrAct = 011b,101b */
    uint32_t outerVlanID : 12;       /*!< Outer VLAN VID, valid if outerVidAct = 01b */
    uint32_t outerVlanPcp : 3;       /*!< Outer VLAN PCP, valid if outerPcpAct = 01b */
    uint32_t outerVlanDei : 1;       /*!< Outer VLAN DEI, valid if outerDeiAct = 01b */
    netc_tb_fm_outer_tpid_act_t outerTpidAct : 3; /*!< Outer TPID action */
    netc_tb_fm_outer_pcp_act_t outerPcpAct : 3;   /*!< Outer PCP action */
    netc_tb_fm_outer_dei_act_t outerDeiAct : 2;   /*!< Outer DEI action */
    netc_tb_fm_payload_act_t pldAct : 3; /*!< Payload Actions, Not applicable for ingress frame modifications */
    uint32_t : 5;
    uint8_t pldOffset;                   /*!< Payload Offset, valid if outerPldAct = 010b */
    uint8_t res1[3];
    uint16_t fmdBytes; /*!< Frame Modification Bytes, valid if outerPldAct = 001b,010b or l2Act = 1b */
    uint16_t res2;
    uint32_t fmdEID;   /*!< Frame Modification Data Entry ID, valid if outerPldAct = 001b,010b or l2Act = 1b. 0xFFFF is
                          null pointer */
} netc_tb_fm_cfge_t;

