tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief FDB table configuration element */
typedef struct _netc_tb_fdb_cfge
{
    uint32_t
        portBitmap : 24; /*!< Forwarding destination Port Bitmap and ET applicability port bitmap when oETEID = 10b */
    uint32_t : 8;
    netc_tb_fdb_oeteid_mode_t oETEID : 2; /*!< Override ET_EID option */
    uint32_t ePort : 5;                   /*!< Egress Ports, active when oETEid = 01b or ctd = 01b */
    uint32_t iMirE : 1;                   /*!< Ingress Mirroring Enable */
    uint32_t : 1;
    netc_tb_fdb_ctd_mode_t ctd : 2;       /*!< Cut-Through Disable */
    uint32_t dynamic : 1;                 /*!< Static or Dynamic Entry, 0b = Static entry, 1b = Dynamic entry */
    uint32_t timeCapE : 1;                /*!< Timestamp Capture Enable when set */
    uint32_t : 19;
    uint32_t etEID; /*!< Base egress treatment table entry id for primary Egress Treatment group, is valid if the oETEID
                       field is set to value other than kNETC_FDBNoEPP. 0xFFFFFFFF is NULL. */
} netc_tb_fdb_cfge_t;

/*! @brief FDB table Activity element */
typedef struct _netc_tb_fdb_acte
{
    uint8_t actCnt : 7;  /*!< Activity Counter */
    uint8_t actFlag : 1; /*!< Activity Flag */
} netc_tb_fdb_acte_t;

/*! @brief FDB table search criteria Key Element Match Criteria */
typedef enum _netc_tb_fdb_sc_keye_mc
{
    kNETC_FDBKeyeMacthAny          = 0x0, /*!< Match any Key Element Criteria */
    kNETC_FDBKeyeMacthFID          = 0x1, /*!< Match Key Element FID */
    kNETC_FDBKeyeMacthMacMulticast = 0x2, /*!< Match Key Element MAC Multicast bit (MAC_ADDR most
                                                significant byte's least significant bit) */
    kNETC_FDBKeyeMacthBoth = 0x3          /*!< Match both FID field and MAC Multicast bit */
} netc_tb_fdb_sc_keye_mc_t;

/*! @brief FDB table search criteria Configuration Element Match Criteria */
typedef enum _netc_tb_fdb_sc_cfge_mc
{
    kNETC_FDBCfgeMacthAny        = 0x0, /*!< Match any Configuration Element Criteria */
    kNETC_FDBCfgeMacthDynamic    = 0x1, /*!< Match Configuration Element dynamic field */
    kNETC_FDBCfgeMacthPortBitmap = 0x2, /*!< Match Configuration Element portBitmap field */
    kNETC_FDBCfgeMacthBoth       = 0x3  /*!< Match both dynamic field and portBitmap */
} netc_tb_fdb_sc_cfge_mc_t;

/*! @brief FDB table search criteria Activity Element Match Criteria */
typedef enum _netc_tb_fdb_sc_acte_mc
{
    kNETC_FDBActeMacthAny   = 0x0, /*!< Match any Activity Element Criteria */
    kNETC_FDBActeMatchExact = 0x1  /*!<  Exact match with Activity Element */
} netc_tb_fdb_sc_acte_mc_t;

/*! @brief FDB table search criteria format */
typedef struct _netc_tb_fdb_search_criteria
{
    uint32_t resumeEntryId;  /*!< Resume Entry ID, pass the NULL Entry ID when starting a search */
    netc_tb_fdb_keye_t keye; /*!< Key Element data which used to match against the table entries */
    netc_tb_fdb_cfge_t cfge; /*!< Configuration Element data which used to match against the table entries */
    struct
    {
        netc_tb_fdb_acte_t acte;             /*!< Activity Element data which used to match against the table entries */
        netc_tb_fdb_sc_keye_mc_t keyeMc : 2; /*!< Key Element data match criteria */
        uint8_t : 6;
        netc_tb_fdb_sc_cfge_mc_t cfgeMc : 3; /*!< Configuration Element data match criteria */
        uint8_t : 5;
        netc_tb_fdb_sc_acte_mc_t acteMc : 1; /*!< Activity Element data match criteria */
        uint8_t : 7;
    };
} netc_tb_fdb_search_criteria_t;

/*! @brief FDB table request data buffer */
typedef struct _netc_tb_fdb_req_data
{
    netc_tb_common_header_t commonHeader; /*!< Define update actions (use netc_tb_fdb_update_action_t)
                                                and query actions */
    union
    {
        uint32_t entryID;                        /*!< Active when access method is kNETC_EntryIDMatch */
        netc_tb_fdb_keye_t keye;                 /*!< Active when access method is kNETC_ExactKeyMatch */
        netc_tb_fdb_search_criteria_t sCriteria; /*!< Active when access method is kNETC_Search */
    };
    netc_tb_fdb_cfge_t cfge;                     /*!< Present only for commands which perform an update or add */
} netc_tb_fdb_req_data_t;

/*! @brief FDB table request response data buffer */
typedef struct _netc_tb_fdb_rsp_data
{
    uint32_t status;  /*!<  RESUME_ENTRY_ID, valid only in responses for commands which use the Search Access Method */
    uint32_t entryID; /*!< Present only for query command */
    netc_tb_fdb_keye_t keye; /*!< Present only for query command */
    netc_tb_fdb_cfge_t cfge; /*!< Present only for query command */
    netc_tb_fdb_acte_t acte; /*!< Present only for query command */
} netc_tb_fdb_rsp_data_t;

/*! @brief FDB table data buffer */
typedef struct _netc_tb_fdb_data
{
    union
    {
        netc_tb_fdb_req_data_t request;
        netc_tb_fdb_rsp_data_t response;
    };
} netc_tb_fdb_data_t;

/*! @brief FDB table entry config */
typedef struct _netc_tb_fdb_config
{
    netc_tb_fdb_keye_t keye;
    netc_tb_fdb_cfge_t cfge;
} netc_tb_fdb_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion FDB Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region L2 IPV4 Multicast Filter Table
#endif

/*! @brief L2 IPV4 Multicast Filter table key type */
typedef enum _netc_tb_l2mcf_key_type
{
    kNETC_IPv4ASMKey = 0U, /*!< Key consists of a filtering ID (FID) and destination multicast IPv4 address */
    kNETC_IPv4SSMKey       /*!< Key consists of a filtering ID (FID), IPv4 source address and multicast IPv4 destination
                              address */
} netc_tb_l2mcf_key_type_t;

/*! @brief L2 IPV4 Multicast Filter table key element */
typedef struct _netc_tb_l2mcf_keye
{
    netc_tb_l2mcf_key_type_t keyType : 4; /*!< Key Type */
    uint32_t : 12;
    uint32_t fid : 12;                    /*!< Filtering ID */
    uint32_t : 4;
    uint32_t ipv4DestAddr;                /*!< IPv4 Destination Address */
    uint32_t ipv4SrcAddr;                 /*!< IPv4 Source Address */
} netc_tb_l2mcf_keye_t;

