tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief ETM Class Queue table entry config */
typedef struct _netc_tb_etmcq_config
{
    uint32_t entryID; /*!< Need use NETC_TB_ETM_CQ_ENTRY_ID macro to create entry ID */
    netc_tb_etmcq_cfge_t cfge;
} netc_tb_etmcq_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion ETM Class Queue Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region ETM Class Scheduler Table
#endif

/*! @brief ETM Class Scheduler table entry ID */
typedef enum _netc_tb_etmcs_entry_id
{
    kNETC_CSSwtPort0 = 0U, /*!< CS Switch PORT 0 entry ID */
    kNETC_CSSwtPort1,      /*!< CS Switch PORT 1 entry ID */
    kNETC_CSSwtPort2,      /*!< CS Switch PORT 2 entry ID */
    kNETC_CSSwtPort3,      /*!< CS Switch PORT 3 entry ID */
    kNETC_CSSwtPort4       /*!< CS Switch PORT 4 entry ID */
} netc_tb_etmcs_entry_id_t;

/*! @brief ETM Class Scheduler table Class queue assignment to scheduler inputs mode */
typedef enum _netc_tb_etmcs_ca_assg
{
    kNETC_CQ7AssignToSchedIn15 = 0U, /*!< CQ 7 assignment to scheduler input 15, means all CQ use strict priority */
    kNETC_CQ7AssignToSchedIn14,      /*!< CQ 7 assignment to scheduler input 14 */
    kNETC_CQ7AssignToSchedIn13,      /*!< CQ 7 assignment to scheduler input 13 */
    kNETC_CQ7AssignToSchedIn12,      /*!< CQ 7 assignment to scheduler input 12 */
    kNETC_CQ7AssignToSchedIn11,      /*!< CQ 7 assignment to scheduler input 11 */
    kNETC_CQ7AssignToSchedIn10,      /*!< CQ 7 assignment to scheduler input 10 */
    kNETC_CQ7AssignToSchedIn9,       /*!< CQ 7 assignment to scheduler input 9 */
    kNETC_CQ7AssignToSchedIn8,       /*!< CQ 7 assignment to scheduler input 8 */
    kNETC_CQ7AssignToSchedIn7        /*!< CQ 7 assignment to scheduler input 7, means all CQ use weighted fair */
} netc_tb_etmcs_ca_assg_t;

/*! @brief ETM Class Scheduler table config element */
typedef struct _netc_tb_etmcs_cfge
{
    netc_tb_etmcs_ca_assg_t cqAssg : 4; /*!< Class Queue Assignment, input 0 to 7 are weighted fair whereby input 8 to
                                           15 are strict priority */
    uint32_t : 12;
    uint32_t oal : 11;                  /*!< Overead accounting length */
    uint32_t : 5;
    struct
    {
        uint8_t xCode : 3; /*!< Weight code x value */
        uint8_t yCode : 5; /*!< Weight code y value */
    } wbfsWeight[8];       /*!< Weight for scheduler input 0 ~ 7, effective weight is: (2^x)/(1-(y/64)) */
} netc_tb_etmcs_cfge_t;

/*! @brief ETM Class Scheduler table request data buffer */
typedef struct _netc_tb_etmcs_req_data
{
    netc_tb_common_header_t commonHeader;
    netc_tb_etmcs_entry_id_t entryID; /*!< One class scheduler entry per port  */
    netc_tb_etmcs_cfge_t cfge;
} netc_tb_etmcs_req_data_t;

/*! @brief ETM Class Scheduler table request response data buffer */
typedef struct _netc_tb_etmcs_rsp_data
{
    netc_tb_etmcs_entry_id_t entryID;
    netc_tb_etmcs_cfge_t cfge;
} netc_tb_etmcs_rsp_data_t;

/*! @brief ETM Class Scheduler table data buffer */
typedef struct _netc_tb_etmcs_data
{
    union
    {
        netc_tb_etmcs_req_data_t request;
        netc_tb_etmcs_rsp_data_t response;
    };
} netc_tb_etmcs_data_t;

/*! @brief ETM Class Scheduler table entry config */
typedef struct _netc_tb_etmcs_config
{
    netc_tb_etmcs_entry_id_t entryID; /*!< One class scheduler entry per port  */
    netc_tb_etmcs_cfge_t cfge;
} netc_tb_etmcs_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion ETM Class Scheduler Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region ETM Congestion Group Table
#endif
/*! @brief ETM Congestion Group table entry ID macro, cgID is represents the Congestion Group ID ,rang in 0 ~ 7, portID
 * is Switch ID, rang in 0 ~ 4 */
#define NETC_TB_ETM_CG_ENTRY_ID(portID, cgID) (((uint32_t)(portID) << 4U) | ((cgID) & 0x7U))

/*! @brief ETM Congestion Group table config element */
typedef struct _netc_tb_etmcg_cfge
{
    uint16_t tdDr0En : 1; /*!< Tail drop enable for DR0 Frame */
    uint16_t tdDr1En : 1; /*!< Tail drop enable for DR1 Frame */
    uint16_t tdDr2En : 1; /*!< Tail drop enable for DR2 Frame */
    uint16_t tdDr3En : 1; /*!< Tail drop enable for DR3 Frame */
    uint16_t oal : 12;    /*!< Overhead accounting length, 2's complement value (range -2048 to +2047)  */
    struct
    {
        uint16_t tn : 5; /*!< TA */
        uint16_t ta : 8; /*!< Tn */
        uint16_t : 3;
    } tdDRThresh[4];     /*!< Tail Drop Threshold (TA * 2^Tn) for DR0 ~ DR3 Frames, valid if tdDrnEn = 1b */
} netc_tb_etmcg_cfge_t;

/*! @brief ETM Congestion Group table statistic element */
typedef struct _netc_tb_etmcg_stse
{
    uint32_t byteCount[2]; /*!< Number of bytes currently in use in all class queues that are members of this group. */
} netc_tb_etmcg_stse_t;

/*! @brief ETM Congestion Group table request data buffer */
typedef struct _netc_tb_etmcg_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_etmcg_cfge_t cfge;
} netc_tb_etmcg_req_data_t;

/*! @brief ETM Congestion Group table request response data buffer */
typedef struct _netc_tb_etmcg_rsp_data
{
    uint32_t entryID;
    netc_tb_etmcg_stse_t stse;
    netc_tb_etmcg_cfge_t cfge;
} netc_tb_etmcg_rsp_data_t;

/*! @brief ETM Congestion Group table data buffer */
typedef struct _netc_tb_etmcg_data
{
    union
    {
        netc_tb_etmcg_req_data_t request;
        netc_tb_etmcg_rsp_data_t response;
    };
} netc_tb_etmcg_data_t;

/*! @brief ETM Congestion Group table entry config */
typedef struct _netc_tb_etmcg_config
{
    uint32_t entryID; /*!< Need use NETC_TB_ETM_CG_ENTRY_ID macro to create entry ID */
    netc_tb_etmcg_cfge_t cfge;
} netc_tb_etmcg_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion ETM Congestion Group Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Egress Count Table
#endif

