tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Egress Count table statistic element */
typedef struct _netc_tb_ec_stse
{
    uint32_t enqFrmCnt[2]; /*!< Enqueued Frame Count */
    uint32_t rejFrmCnt[2]; /*!< Rejected Frame Count */
} netc_tb_ec_stse_t;

/*! @brief Egress Count table request data buffer */
typedef struct _netc_tb_ec_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
} netc_tb_ec_req_data_t;

/*! @brief Egress Count table request response data buffer */
typedef struct _netc_tb_ec_rsp_data
{
    uint32_t entryID;
    netc_tb_ec_stse_t stse;
} netc_tb_ec_rsp_data_t;

/*! @brief Egress Count table data buffer */
typedef struct _netc_tb_ec_data
{
    union
    {
        netc_tb_ec_req_data_t request;
        netc_tb_ec_rsp_data_t response;
    };
} netc_tb_ec_data_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Egress Count Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Buffer Pool Table
#endif

/*! @brief Buffer pool and shared buffer pool threshold macro, the threshold = MANT*2^EXP, uint is internal memory words
 * (avergae of 20 bytes each) */
#define NETC_TB_BP_THRESH(mant, exp) (((uint32_t)((mant) & 0xFF) << 4U) | ((exp) & 0xF))

/*! @brief Buffer Pool Flow Control (FC) Configuration */
typedef enum _netc_tb_bp_fc_cfg
{
    kNETC_FlowCtrlDisable = 0U, /*!< Flow Control disabled */
    kNETC_FlowCtrlWithBP,       /*!< Flow Control enabled using only buffer pool FC state. */
    kNETC_FlowCtrlWithSBP,      /*!< Flow Control enabled using only shared buffer pool FC state. */
    kNETC_FlowCtrlWithBPAndSBP  /*!<  Flow Control enabled using both buffer pool and shared buffer pool FC state, only
                                   both 1 trigger the Flow Control ON */
} netc_tb_bp_fc_cfg_t;

/*! @brief Buffer Pool table config element */
typedef struct _netc_tb_bp_cfge
{
    bool sbpEn : 1; /*!< Shared Buffer Pool Enable, set true measn a shared buffer pool is associated with this buffer
                       pool */
    netc_tb_bp_fc_cfg_t gcCfg : 2; /*!< Flow Control (FC) Configuration */
    uint8_t : 5;
    uint8_t pfcVector;             /*!< Priority Flow Control (PFC) Vector, not support in NETC 3.0 and 3.1 version */
    uint16_t maxThresh : 12;       /*!< Maximum Threshold, value 0 means disable maximum threshold checking, use
                                      NETC_TB_BP_THRESH macro to set this value */
    uint16_t : 4;
    uint16_t fcOnThresh : 12;  /*!< Flow Control On Threshold, If the buffer pool usage crosses this threshold, and if
                                 fcOnThresh is greater than fcOffThresh, the flow control state of the buffer pool
                                 is set to 1, use NETC_TB_BP_THRESH macro to set this value. */
    uint16_t : 4;
    uint16_t fcOffThresh : 12; /*!< Flow Control Off Threshold, If buffer pool usage drops to this threshold or below,
                                      the flow control state of the buffer pool is set to 0, , use NETC_TB_BP_THRESH
                                  macro to set this value */
    uint16_t : 4;
    uint32_t sbpThresh : 12;   /*!< Shared Buffer Pool Threshold, use NETC_TB_BP_THRESH macro to set this value */
    uint32_t : 20;
    uint32_t sbpEid;           /*!< Shared Buffer Pool Entry ID, valid if sbpEn is true */
    uint32_t fcPorts;          /*!< Flow Control Port bitmap, indicates which ports are to be flow controlled for this
                                     buffer pool */
} netc_tb_bp_cfge_t;

/*! @brief Buffer Pool table State Element Data*/
typedef struct _netc_tb_bp_bpse
{
    uint32_t amountUsed; /*!< Amount Used, number of internal memory words (average of 20 bytes each) currently in use
                              in this buffer pool. */
    uint32_t amountUsedHWM; /*!< Amount Used High Watermark, value sticks at the highest AMOUNT_USED seen since the last
                               watermark reset */
    uint32_t fcState : 1;   /*!< Flow Control (FC) State, ON (1) or OFF (0)  */
    uint32_t bpd : 1; /*!< Buffer Pool Disabled, 1 means the  buffer pool has been disabled due to an uncorrectable ECC
                         error */
    uint32_t : 30;
} netc_tb_bp_bpse_t;

/*! @brief Buffer Pool table request data buffer */
typedef struct _netc_tb_bp_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_bp_cfge_t cfge;
} netc_tb_bp_req_data_t;

/*! @brief Buffer Pool table request response data buffer */
typedef struct _netc_tb_bp_rsp_data
{
    uint32_t entryID;
    netc_tb_bp_bpse_t bpse;
    netc_tb_bp_cfge_t cfge;
} netc_tb_bp_rsp_data_t;

/*! @brief Buffer Pool table data buffer */
typedef struct _netc_tb_bp_data
{
    union
    {
        netc_tb_bp_req_data_t request;
        netc_tb_bp_rsp_data_t response;
    };
} netc_tb_bp_data_t;

/*! @brief Buffer Pool table entry config */
typedef struct _netc_tb_bp_config
{
    uint32_t entryID;       /*!< Buffer pool ID, range in 0 ~ (SWT_GetBPTableEntryNum() - 1) */
    netc_tb_bp_cfge_t cfge; /*!< Buffer Pool table config element */
} netc_tb_bp_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Buffer Pool Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Shared Buffer Pool Table
#endif
/*! @brief Shared Buffer Pool table config element */
typedef struct _netc_tb_sbp_cfge
{
    uint32_t : 16;
    uint32_t maxThresh : 12;   /*!< Maximum Threshold, If shared buffer pool usage is greater than or equal to this
                                  threshold, use NETC_TB_BP_THRESH macro to set this value */
    uint32_t : 4;
    uint16_t fcOnThresh : 12;  /*!< Flow Control On Threshold, If the shared buffer pool usage crosses this threshold,
                                 and if fcOnThresh is greater than fcOffThresh, the flow control state of the buffer pool
                                 is set to 1, use NETC_TB_BP_THRESH macro to set this value.  */
    uint16_t : 4;
    uint16_t fcOffThresh : 12; /*!< Flow Control Off Threshold, If shared buffer pool usage drops to this threshold or
                                  below, the flow control state of the buffer pool is set to 0, use NETC_TB_BP_THRESH
                                  macro to set this value */
    uint16_t : 4;
} netc_tb_sbp_cfge_t;

