tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Status/Interrupts flags for the TX BDR. Each flag get its own bit thus it support bit AND/OR operation. */
typedef enum _netc_tx_bdr_flags
{
    kNETC_TxBDRSystemBusErrorFlag = 0x1,
    kNETC_TxBDRBusyFlag           = 0x1 << 1U,
    kNETC_TxBDRStatusFlagsMask    = kNETC_TxBDRBusyFlag | kNETC_TxBDRBusyFlag,
    // TODO, Append the interrupt flags
} netc_tx_bdr_flags_t;

/*! @brief Configuration for the SI Rx Buffer Descriptor Ring Configuration. */
typedef struct _netc_rx_bdr_config
{
    // Descriptor data structure
    bool extendDescEn;       /*!< False - Use 16Bytes standard BD. True - Use 32Bytes extended BD. */
    netc_rx_bd_t *bdArray;   /*!< BD ring base address which shall be 128 bytes aligned. */
    uint32_t len;            /*!< BD ring length in the unit of 16Bytes standard BD. Shall be multiple of 8/16 for
                                standard/exteneded BD. */
    uint64_t *buffAddrArray; /*!< Rx buffers array with BD length(half of BD length if use exteneded BD). */
    uint16_t buffSize;       /*!< Size of all Rx buffers in this BD ring. */
    // Interrupt
    bool enThresIntr;        /*!< Enable/Disable threshold interrupt. */
    bool enCoalIntr;         /*!< Enable/Disable interrupt coalescing. */
    uint32_t intrThreshold;  /*!< Interrupt coalescing packet threshold. */
    uint32_t intrTimerThres; /*!< Interrupt coalescing timer threshold, specified in NETC clock cycles. */
    uint8_t msixEntryIdx;    /*!< MSIX entry index of Rx ring interrupt. */
    // Ring configuration
    bool disVlanPresent; /*!< Disable/Enable VLAN in BD. */
    bool enVlanExtract;  /*!< Enable/Disable VLAN extract. */
    bool isKeepCRC;      /*!< Whether user provided the CRC32 - FCS at end of frame. */
    bool congestionMode; /*!< False - lossy. True - lossless. */
    bool enHeaderAlign;  /*!< Enable/disable +2B alignment to frame. */
} netc_rx_bdr_config_t;

/*! @brief Receive BD ring handler data structure. */
typedef struct _netc_rx_bdr
{
    netc_rx_bd_t *bdBase; /*!< Rx BDR base address. */
    bool extendDesc;      /*!< Use extended buffer descriptor. */
    uint16_t index;       /*!< Current index for read. */
    uint32_t len;         /*!< Length of this BD ring, unit of 16Bytes standard BD. */
    uint64_t *buffArray;  /*!< Rx buffers array of this ring. */
    uint32_t buffSize;    /*!< Rx buffers size for all BDs in this ring. */
} netc_rx_bdr_t;

/*! @brief Status/Interrupts flags for the RX BDR. Each flag get its own bit thus it support bit AND/OR operation. */
typedef enum _netc_rx_bdr_flags
{
    kNETC_RxBDRSystemBusErrorFlag = 0x1,
    kNETC_RxBDREmptyFlag          = 0x1 << 1U,
    // TODO, Append the interrupts flags
} netc_rx_bdr_flags_t;

/*! @brief Configuration for the buffer descriptors ring */
typedef struct _netc_bdr_config
{
    netc_rx_bdr_config_t *rxBdrConfig; /*!< Receive buffer ring configuration array. */
    netc_tx_bdr_config_t *txBdrConfig; /*!< Transmit buffer ring configuration array. */
} netc_bdr_config_t;

/*!
 * @brief PSI message interrupt type.
 */
typedef enum _netc_psi_msg_flags_t
{
    kNETC_PsiRxMsgFromVsi1Flag = 0x2,     /*!< Message receive interrupt enable, initiated by VSI1. */
    kNETC_PsiRxMsgFromVsi2Flag = 0x4,     /*!< Message receive interrupt enable, initiated by VSI2. */
    kNETC_PsiRxMsgFromVsi3Flag = 0x8,     /*!< Message receive interrupt enable, initiated by VSI3. */
    kNETC_PsiFLRFromVsi1Flag   = 0x20000, /*!< Function level reset interrupt enable, initiated by VSI1. */
} netc_psi_msg_flags_t;

/*!
 * @brief VSI message interrupt flags.
 */
typedef enum _netc_vsi_msg_flags
{
    kNETC_VsiMsgTxFlag = 0x1,       /*!< Message sent to PSI has completed and response received. */
    kNETC_VsiMsgRxFlag = 0x1 << 1U, /*!< Message received from PSI. */
} netc_vsi_msg_flags_t;

/*!
 * @brief VSI number bit map, VSI1 starts from bit1.
 */
typedef enum _netc_vsi_number
{
    kNETC_Vsi1 = 0x1 << 1U,
    kNETC_Vsi2 = 0x1 << 2U,
    kNETC_Vsi3 = 0x1 << 3U,
    /* Reserved for multiple VSIs. */
} netc_vsi_number_t;

/*!
 * @brief PSI receive message information
 */
typedef struct _netc_psi_rx_msg
{
    uint8_t *msgBuff; /*!< The buffer address application set before receiving message. */
    uint32_t msgLen;  /*!< Received message length. */
} netc_psi_rx_msg_t;

/*!
 * @brief VSI message transmit status
 */
typedef struct _netc_vsi_msg_tx_status
{
    bool txBusy;      /*!< The VSI Tx busy flag, become idle when the PSI receive and clear the related status. */
    bool isTxErr;     /*!< Tx error flag. */
    uint16_t msgCode; /*!< The error code or user-defined content. */
} netc_vsi_msg_tx_status_t;

/*! @} */ // end of netc_hw_si
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_si
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_switch
#endif
/*! @addtogroup netc_hw_switch
 * @{
 */
/*! @brief The switch port bitmap */
typedef enum _netc_swt_port_bitmap
{
    kNETC_SWTPort0Bit = 0x1U,  /*!< Switch port0 bitmap */
    kNETC_SWTPort1Bit = 0x2U,  /*!< Switch port1 bitmap */
    kNETC_SWTPort2Bit = 0x4U,  /*!< Switch port2 bitmap */
    kNETC_SWTPort3Bit = 0x8U,  /*!< Switch port3 bitmap */
    kNETC_SWTPort4Bit = 0x10U, /*!< Switch port4 (internal port) bitmap */
} netc_swt_port_bitmap_t;
/*! @brief The switch ingress mirror destination port */
typedef enum _netc_swt_imr_dest_port
{
    kNETC_SWTPort0 = 0U, /*!< Switch port0 */
    kNETC_SWTPort1 = 1U, /*!< Switch port1 */
    kNETC_SWTPort2 = 2U, /*!< Switch port2 */
    kNETC_SWTPort3 = 3U, /*!< Switch port3 */
    kNETC_SWTPort4 = 4U, /*!< Switch port4 */
    kNETC_SWTMPort = 5U  /*!< Switch management port */
} netc_swt_imr_dest_port_t;

/*! @brief The switch MAC forwarding options */
typedef enum _netc_swt_mac_forward_mode
{
    kNETC_NoFDBLookUp        = 1U,   /*!< No FDB lookup is performed, the frame is flooded. */
    kNETC_FDBLookUpWithFlood = 2U,   /*!< FDB lookup is performed, and if there is no match, the frame is flooded to the
                                        port bitmap in VLAN filter entry. */
    kNETC_FDBLookUpWithDiscard = 3U, /*!< FDB lookup is performed, and if there is no match, the frame is discarded. */
} netc_swt_mac_forward_mode_t;

/*! @brief The switch MAC learning options */
typedef enum _netc_swt_mac_learn_mode
{
    kNETC_DisableMACLearn = 1U, /*!< Disable MAC learning. SMAC FDB lookup is by-passed. */
    kNETC_HardwareMACLearn,     /*!< Hardware MAC learning is enabled. */
    kNETC_SeSoftwareMACLearn, /*!< Software MAC learning secure. FDB lookup based on FID and SMAC is performed and if an
                                 entry is not found, the frame is redirected to the switch management port. */
    kNETC_UnseSoftwareMACLearn, /*!<  Software MAC learning unsecure. FDB lookup based on FID and SMAC is performed and
                                   if an entry is not found, the frame is copied to the switch management port. */
    kNETC_DisableMACLearnWithSMAC /*!< Disable MAC learning with SMAC validation. FDB lookup based on FID and SMAC is
                                     performed and if an entry is not found, the frame is discarded. */
} netc_swt_mac_learn_mode_t;

/*! @brief Switch transmit Bridge Port VLAN Tag Action */
typedef enum _netc_swt_port_tx_vlan_act
{
    kNETC_NoTxVlanModify = 0U, /*!< No egress VLAN modification performed */
    kNETC_TxDelOuterVlan,      /*!< Delete outer VLAN tag */
    kNETC_TxReplOuterVlanVid   /*!< Replace outer VLAN tag's VID with 0; frame to be transmitted as a priority tag frame
                                */
} netc_swt_port_tx_vlan_act_t;

