tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc.h
/*! @brief Switch port spanning tree group work mode */
typedef enum _netc_swt_port_stg_mode
{
    kNETC_DiscardFrame = 0U,  /*!< Tx or RX Frames on this port with current spanning tree group ID will be discarded */
    kNETC_LearnWithoutFowrad, /*!< RX Frames on this port with current spanning tree group ID will do Learn SMAC, but do
                                 not forward, Tx Frame will be discarded */
    kNETC_ForwardFrame /*!< RX Frames on this port with current spanning tree group ID will do both MAC learning and
                          forwarding, , Tx Frame will be forwarded. */
} netc_swt_port_stg_mode_t;

/*! @brief Switch Ingress mirror destination config */
typedef struct _etc_swt_imr_config
{
    bool enMirror;                     /*!< Enable ingress mirroring */
    netc_swt_imr_dest_port_t destPort; /*!< Port where ingress mirrored frames are sent */
    uint8_t dr;                        /*!< Mirrored packet's DR (drop resilience) */
    uint8_t ipv;                       /*!< Mirrored packet's IPV (internal priority value) */
    uint8_t efmLengthChange; /*!< Egress Frame Modification Frame Length change in 2s complement notation, Vaild if
                                efmEntryID is noy null */
    uint16_t efmEntryID; /*!< Egress Frame Modification Entry Id, note 0xFFFF is a Null Frame Modification Entry, Only
                            applicable if destPort != kNETC_SWTMPort */
} netc_swt_imr_config_t;

/*! @brief Switch port bridge configuration */
typedef struct _netc_swt_port_config
{
    netc_swt_port_tx_vlan_act_t
        txVlanAction : 2;       /*!< Only applies for the frame outer VLAN tag's VID is equal to the port default VID */
    bool isRxVlanAware : 1;     /*!< Receive VLAN Aware Mode */
    bool acceptUntag : 1;       /*!< Accept untagged frame */
    bool acceptPriorityTag : 1; /*!< Accept priority tagged frame (VID = 0) */
    bool acceptSingleTag : 1;   /*!< Accept single tagged frame */
    bool acceptDoubleTag : 1;   /*!< Accept double tagged frame (ounter and inner) */
    struct
    {
        uint32_t : 15;
        uint32_t vid : 12; /*!< Vlan Identifier. */
        uint32_t dei : 1;  /*!< Drop eligible indicator */
        uint32_t pcp : 3;  /*!< Priority code point. */
        uint32_t tpid : 1; /*!< Tag protocol identifier, 0 = Standard C-VLAN 0x8100, 1 = Standard S-VLAN 0x88A8. */
    } defaultVlan;
    netc_swt_port_stg_mode_t
        stgMode[16];           /* Port spanning tree protocol state for spanning tree protocol group 0 ~ 15 */
    bool enSrcPortPrun : 1;    /*!< Enable/Disable received frame be transmitted to same port it was received */
    bool enMacStationMove : 1; /*!< Enable/Disable received frame which ingress port not match the FDB entry Destination
                              Port Bitmap */
    bool enBcastStormCtrl : 1; /*!< Enable/Disable Storm control for broadcast frames */
    bool enMcastStormCtrl : 1; /*!< Enable/Disable Storm control for multicast frames */
    bool enUnMcastStormCtrl : 1; /*!< Enable/Disable Storm control for unknown multicast frames */
    bool enUnUcastStormCtrl : 1; /*!< Enable/Disable Storm control for unknown unicast frames */
    uint32_t bcastRpEntryID;     /*!< Broadcast rate policer entry ID. Valid if enBroadStormCtrl = true */
    uint32_t mcastEntryID;       /*!< Known multicast rate policer entry ID. Valid if enBroadStormCtrl = true */
    uint32_t unMcastRpEntryID;   /*!< Unknown multicast policer entry ID. Valid if enUnMultiStormCtrl = true */
    uint32_t unUcastRpEntryID;   /*!< Unknown unicast rate policer entry ID. Valid if enUnUniStormCtrl = true */
    uint16_t maxDynaFDBEntry;    /*!< The maximium number of dynamic entries in the FDB table, 0 means no limit */
} netc_swt_port_bridge_config_t;

/*! @brief Switch Port level Frame Modification configuration (PPCPDEIMR and PQOSMR[QVMP])*/
typedef struct _netc_swt_port_fm_config
{
    bool ignoreFMMiscfg : 1;   /*!< Enable/Disable ignore the Frame Modification Misconfiguration Action */
    bool enEgressPcpMap : 1;   /*!< Enable egress frame modification of outer VLAN tag's PCP value is mapped to a new
                                  value based on egressPcpMap, used for Frame Modification VLAN Outer PCP action */
    bool enIngressPcpMap : 1;  /*!< Enable ingress frame modification of outer VLAN tag's PCP value is mapped to a
                                  new value based on egressPcpMap, used for Frame Modification VLAN Outer PCP action */
    bool enUpdateVlanDei : 1;  /*!< Enable update DR value in the  outer VLAN based on DEnDEI field, used for egress
                                Frame  Modification Outer DEI action */
    uint8_t drToDeiMap : 4;    /*!< Mapping of internal QoS's DR value n to VLAN DEI, The 4 bits correspond to the DR3 ~
                                  DR0, and 1 means DRn mapping to DEI 1, 0 means DRn mapping to DEI 0 */
    uint8_t egressPcpMap : 4;  /*!< Egress PCP to PCP Mapping Profile instance, active when enEgressPcpMap is true */
    uint8_t ingressPcpMap : 4; /*!< Ingress PCP to PCP Mapping Profile instance, active when enIngressPcpMap is true */
    uint8_t qosVlanMap : 4; /*!< Transmit QoS to VLAN PCP Mapping Profile index, used for egress Frame Modification VLAN
                               Add/Replace Action */
} netc_swt_port_fm_config_t;

/*! @brief  Switch VLAN filter hash table default entry configuration, which determines the default entry when not found
 * in VLAN filter lookup */
typedef struct _netc_swt_default_vlan_filter
{
    bool enIPMFlood;        /*!< Enable IP Multicast Flooding */
    bool enIPMFilter;       /*!< Enable IP Multicast Filtering */
    uint8_t stgID;          /*!< Spanning Tree Group Member ID, range in 0 ~ 15 */
    uint8_t portMembership; /*!< The bit 0 ~ 4 correspond to the 5 ports, When bit set (0b1), means the port is a member
                               of this VLAN. Port membership is used for source/destination pruning */
    bool enUseFilterID;     /*!< Enable use the specified filterID as FID, otherwise will use the frame VID */
    uint16_t filterID; /*!< Used as a key value to do FDB table and the L2 IPV4 Multicast Filter table lookup. Valid if
                          enUseFilterID is true */
    netc_swt_mac_forward_mode_t mfo; /*!< MAC forwarding options */
    netc_swt_mac_learn_mode_t mlo;   /*!< MAC learning options */
    uint16_t baseETEID;              /*!< Base Egress Treatment Entry ID */
    uint8_t etaPortBitmap;           /*!< Egress Treatment Applicability Port. Valid if baseETEID is not null. */
} netc_swt_default_vlan_filter_t;

/*! @brief Bridge config */
typedef struct _netc_swt_bridge_config
{
    netc_swt_default_vlan_filter_t
        dVFCfg; /*!< Default VLAN filter entry configuration when not found in VLAN filter lookup */
} netc_swt_bridge_config_t;

/*! @brief Switch PSFP configuration */
typedef struct _netc_swt_psfp_config
{
    netc_isi_kc_rule_t kcRule[4]; /*!< Key construction rules */
} netc_swt_psfp_config_t;

/*! @brief Switch Qos Classification configuration (include two profiles) */
typedef struct _netc_qos_classify_config
{
    netc_qos_classify_profile_t profiles[2];
} netc_swt_qos_classify_config_t;

/*! @brief Switch QoS to PCP mapping and PCP to PCP mapping configuration when egress packet modification the VLAN tag
 */
typedef struct _netc_swt_qos_to_vlan_config
{
    struct fsl_netc
    {
        uint8_t qos[32]; /*!< Index is created from IPV (3 bits) + DR (2 bits) field. Value is the mapped PCP for VLAN
                            tag. */
        uint8_t pcp[8];  /*!< Index is created from outer PCP (3 bits) field. Value is the mapped PCP for VLAN tag. */
    } profiles[2];
} netc_swt_qos_to_vlan_config_t;

/*! @brief Switch static/dynamic FDB entries in-use statistic */
typedef struct _netc_switch_inuse_fdb_statistic
{
    uint16_t camEntries;        /*!<  Number of FDB entries in-use in the CAM. */
    uint16_t staticEntries;     /*!< Number of static FDB entries in-use (both hash-based and CAM-based entries). */
    uint16_t dynamicEntries;    /*!< Number of dynamic FDB entries in-use (hash-based and CAM-based entries). */
    uint16_t dynamicEntriesHWM; /*!< High water mark of dynamic entries in-use in the FDB table. */
} netc_switch_inuse_fdb_statistic_t;

/*! @brief Port seamless redundancy configuration */
typedef struct _netc_swt_port_sr_config
{
    uint16_t isqEID;
    uint8_t pathId;
    bool txSqta;
    bool srcPortFlt;
    bool sdfa;
    bool srPort;
} netc_swt_port_sr_config_t;

/*! @} */ // end of netc_hw_switch
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_switch
#endif

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
}
#endif
#endif /* FSL_NETC_H_ */
